import React, { useState, useEffect} from 'react'
import { Route, Link} from 'react-router-dom'
import { Container, Table, Row, Col, ListGroup} from 'react-bootstrap'
import { useParams } from 'react-router-dom/cjs/react-router-dom.min'
const test = [
    {
      "ID": "C1_315081500H_000152",
      "Name": "大武崙砲台",
      "DescriptionDetail": "大武崙砲台位於基隆西北方，居外木山漁港後的大武崙山上，也就是情人湖的上方。因其地勢險要，而成為扼守基隆港西側的重要據點，在道光二十年，西元1840年的清英鴉片戰爭及光緒十年，西元1884年的清法戰爭時，清政府均曾派兵駐防。但據其構造及設計特色來看，應為日治時期所改建之結果。  大武崙砲台為國定古蹟，位於大武崙山巔，地形居高臨下，地勢非常險要，其標高為231公尺，可西瞰情人湖，北俯大武崙澳，東望基隆港及東海。在進入砲台區的入口處，是一條充滿林蔭落葉的碎石步道。而當抵達山頂的砲台區時，尚可看見以塊石丁順疊砌的砲台結構、砲盤、儲彈室及運輸砲台、機械坡道，雖然現今大砲已經不存在了，但地面仍有明顯的砲架痕跡。      大武崙砲台遺址保存良好，包括營區大門步道、洞窟營舍、東稜堡、北稜堡、南稜堡、避彈壕、蓄水池等。區內幽靜、林木翠綠，登上環道的短牆上眺覽四周，基隆嶼、外木山澳漁村、八斗子、北海岸一帶的秀麗風光盡收眼底，是一處觀景、談心的好地，也常為婚紗公司取景之選擇，增添它浪漫的風情。  資料來源於：基隆市政府",
      "Description": "大武崙砲台位於基隆西北方，居外木山漁港後的大武崙山上，也就是情人湖的上方。因其地勢險要，而成為扼守基隆港西側的重要據點，在道光二十年，西元1840年的清英鴉片戰爭及光緒十年，西元1884年的清法戰爭時，清政府均曾派兵駐防。但據其構造及設計特色來看，應為日治時期所改建之結果。  大武崙砲台為國定古蹟，位於大武崙山巔，地形居高臨下，地勢非常險要，其標高為231公尺，可西瞰情人湖，北俯大武崙澳，東望基隆港及東海。在進入砲台區的入口處，是一條充滿林蔭落葉的碎石步道。而當抵達山頂的砲台區時，尚可看見以塊石丁順疊砌的砲台結構、砲盤、儲彈室及運輸砲台、機械坡道，雖然現今大砲已經不存在了，但地面仍有明顯的砲架痕跡。      大武崙砲台遺址保存良好，包括營區大門步道、洞窟營舍、東稜堡、北稜堡、南稜堡、避彈壕、蓄水池等。區內幽靜、林木翠綠，登上環道的短牆上眺覽四周，基隆嶼、外木山澳漁村、八斗子、北海岸一帶的",
      "Phone": "886-2-24287664",
      "Address": "基隆市安樂區基金一路208巷19號(情人湖上方)",
      "OpenTime": "開放式空間 隨時開放",
      "Picture": {
        "PictureUrl1": "http://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04005325"
      },
      "Position": {
        "PositionLat": 25.15675926208496,
        "PositionLon": 121.70555877685547,
        "GeoHash": "wsqx17xk9"
      },
      "Class1": "古蹟類",
      "WebsiteUrl": "http://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04005325",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 基隆市, 大武崙砲台",
      "City": "基隆市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_376570000A_000008",
      "Name": "情人湖濱海大道(外木山濱海大道)",
      "DescriptionDetail": "每到假日，基隆著名的外木山情人湖濱海大道總是吸引大批賞景人潮，除飽覽海天一色風光，遠眺基隆嶼，看大船入港外，沿線並有多家的海產餐廳及咖啡館，有名的龍蝦痲糬及假日漁市的鯊魚煙，更是不容錯過，是闔家大小一日遊的好去處。外木山海岸為基隆市轄區僅存最長的天然海岸，自外木山漁港至澳底通村全長5公里的海岸公路，原為安中產業道路，一側為開闊的海岸景觀，一側為高聳的單面懸崖，是富狀麗景色的海岸線；經基隆市府規劃設計為觀光休閒道路，並正式命名為情人湖濱海大道。完工後的情人湖濱海大道，由於沿線風光秀麗，除可飽覽海天一色風光外，遠眺基隆嶼，看大船入港外，也是休閒、健行的好去處；晚上更可欣賞海面上漁火點點，因此也吸引許多的遊客前來，基隆市政府也在此興建多座的觀景平台，坐在岸邊，聆聽濤聲，欣賞彩霞萬丈之景，令人心曠神怡，海岸礁岩長年經海水沖蝕，雕塑出奇特的造型，值得深入觀賞體會。此外，在外木山漁港附近，除有小型觀光假日漁市外，並有早泳會設置的游泳設施，提供泳技較佳者在此游泳或浮潛；澳底漁村的沙灘是僅存的沙岸地形，小而美麗；除有名的龍蝦痲糬及假日漁市的鯊魚煙，經常可看到門口大排長龍外，沿線並有多家的海產餐廳及咖啡館，是一個適合闔家大小及青年朋友、情侶等前來遊玩的好去處。",
      "Description": "全長5公里的海岸公路，一側為海岸景觀，一側為單面懸崖，澳底漁村的沙灘是僅存的沙岸地形，小而美麗。坐在岸邊，聆聽濤聲，欣賞彩霞萬丈，令人心曠神怡。海岸礁岩長年經海水沖蝕，雕塑出奇特造型，值得深入觀賞體會。",
      "Phone": "886-2-24287664",
      "Address": "基隆市中山區湖海路一、二段(協和街)",
      "ZipCode": "203",
      "TravelInfo": "搭乘基隆市公車302號公車於「中山高中站」下車，步行約20分鐘即可抵達。假日增開基隆市305號公車於「情人湖濱海大道紀念碑站」下車，沿線即為情人湖濱海大道。班車行駛時間為14:30-21:30，每整點開車，每年十二月至次年四月停駛。",
      "OpenTime": "開放式空間，無時間限制",
      "Picture": {},
      "MapUrl": "http://g.co/maps/9hc4h",
      "Position": {
        "PositionLat": 25.163110733032227,
        "PositionLon": 121.72789764404297,
        "GeoHash": "wsqx1uz99"
      },
      "Class1": "遊憩類",
      "Class2": "自然風景類",
      "Level": "非古蹟",
      "ParkingInfo": "沿途有多座停車場，可停大小汽車",
      "ParkingPosition": {},
      "TicketInfo": "免門票",
      "Keyword": "外木山",
      "City": "基隆市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_376570000A_000048",
      "Name": "和平島公園",
      "DescriptionDetail": "和平島原名社寮島，位於基隆東北一禹，是基隆港的門戶，同時也是北台灣最早有西方人足跡的地方，亦是基隆最早有漢人入墾的所在地之一。此地早期原為凱達格蘭族的聚落，之後被列為軍事管制區，目前在沿海部份地區已開放設為和平島公園。 和平島公園的遊憩重點，就是園區內重要的海蝕地形景觀，位在海岸線旁的奇岩巨石，因長期受迎風面海蝕及風蝕影響，造就了特殊的地形景觀，如海蝕崖、海蝕平台、海蝕溝、海蝕崖、風化窗、獅頭岩、熊頭岩等，最著名的則是「豆腐岩」和「萬人堆」(蕈狀石)地形景觀，各種不同的海蝕地形，是小朋友們戶外教學最喜歡來的地方，不僅可以真實看到課本上的圖片，也能實際的感受到自然的力量。除了瑰麗的地形外，露出地層的生物本體化石和生痕化石是和平島地質上的寶貝，腳下踩著幾十萬年的化石，都讓人感到相當興奮及新奇，另外，在海邊惡劣條件下生長的海濱植物，更是需要遊客停下腳步細細觀賞。 和平島公園內的海岸，有一處相當著名的歷史遺跡－「蕃字洞」，為基隆市少數僅存的西荷時期遺蹟，洞長20公尺，據說是荷蘭人於西元1668年撤離社寮島前，於洞內的所刻的文字。岩石屬於砂岩，緊鄰海邊，幾百年來受強勁的東北季風吹襲，洞內文字已風化剝落，需要仔細觀察才能看出端倪。退潮的海蝕平台可讓人們赤腳戲水，並觀察各種不同的潮間帶生物，而奇岩怪石則是要好好發揮想像力，可以從中得到不少樂趣，如果玩累了走累了，就駐足停坐在海濱的岩石上，聆聽海浪拍岸濤聲，仔細聽聽大自然的聲音，讓身心都可以得到釋放，這樣子的體驗絕對令您回味無窮。 和平島公園旅客服務中心(仿西班牙式薩爾瓦多城)，已完工落成正式啟用，和平島公園也委外管理，提醒遊客公園內遊玩也要注意安全，儘量勿於海蝕崖下停留嬉戲，因為此處為不穩定地形，隨時有崩落之危險。",
      "Description": "和平島是基隆港的門戶，目前在沿海部份地區設海濱公園，園區內有重要的海蝕地形景觀，有海蝕崖、海蝕平台、海蝕溝，最著名的為「豆腐岩」和「萬人堆」地形景觀，地層上的生物本體化石和生痕化石是本區地質特色。",
      "Phone": "886-2-24635452",
      "Address": "基隆市中正區平一路360號",
      "ZipCode": "202",
      "TravelInfo": "搭乘基隆市公車101號於「和平島公園站」下車，步行約5分鐘即可到達。",
      "OpenTime": "AM 08:00 ～ PM 17:00",
      "Picture": {},
      "MapUrl": "http://g.co/maps/x4w8s",
      "Position": {
        "PositionLat": 25.160839080810547,
        "PositionLon": 121.76380157470703,
        "GeoHash": "wsqx4u3sw"
      },
      "Class1": "自然風景類",
      "Class2": "遊憩類",
      "Level": "非古蹟",
      "ParkingInfo": "自備停車場",
      "ParkingPosition": {},
      "TicketInfo": "免費",
      "Remarks": "和平島公園整建工程已大致完成，目前開放遊客進入，惟汽、機車尚未開放入園。請進入和平島公園之遊客注意近水區域之自身安全，並共同維護園區之環境清潔。",
      "Keyword": "和平島",
      "City": "基隆市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_376570000A_000069",
      "Name": "情人湖公園",
      "DescriptionDetail": "情人湖公園位於基隆市西郊外寮里的大武崙山山腰上，由六條小溪匯集流入而成，為基隆僅有的高地湖泊，湖面雖然沒有很寬闊，但景色精緻秀麗，頗有小家碧玉之美，附近林木茂密，湖水碧綠，山光水色，清新怡人，春夏時節到處蟲鳴鳥叫，彩蝶飛舞，候鳥遷徒，值得民眾共赴自然之約。情人湖原名「五叉碑」，後來因救國團基隆團委員會經常在此辦活動，予以命名為情人湖。湖區規劃有觀景亭、情人吊橋、觀景水岸平台、風車、環山和環湖步道等設施，步道兩旁林木蓊鬱，而各種植物則展現四季風貌，在享受芬多精森林浴的同時，沿途並可欣賞湖光山色，相當詩情畫意。往情人湖的北邊走去，有步道可登上面海的山嶺，從稜線的步道上觀看大海，不僅可以見到岸邊的澳底漁港，亦可遠眺基隆嶼及野柳海岬，令人心胸頓時開朗舒暢。情人湖名字的由來另一種說法，因為風景區內有一大一小兩個相連的湖泊，像是情人互相依偎陪伴，因此而得名，也因為這樣，情人湖有一個相當浪漫的傳說，聽說情人湖上的情人橋有某種特別魔力，情人到此遊玩時，只要攜手一起走過情人橋，就會有好的姻緣，因為這個美麗的傳說，也有許多新人特地前往此地拍攝婚紗照片，情人湖旁造型別緻的風車也為這個傳說增添了更多的美感。位於情人湖正東方的砲台山，不僅是附近地區的最高峰，同時也是相當有歷史的地區，山頂的大武崙砲台(國定古蹟)建於清道統年間，是清法戰爭當時留下的重要古蹟之一，圍牆及相關建築物被保存下來的相當多，而周圍的老榕樹盤結糾纏其間，也替此區更增添了不少古意。情人湖風景區是外地觀光客必定要遊覽的地區，風景秀麗、空氣清新，附近還有大武崙砲台等景點，不妨一同規劃至您的旅遊行程中。",
      "Description": "情人湖為基隆僅有的高地湖泊，附近林木茂密，湖水碧綠，規劃有觀景亭、吊橋、觀景水岸平台、風車等設施。步道兩旁林木蓊鬱，各種植物則展現四季風貌，在享受芬多精森林浴的同時，民眾不妨利用步道旁的觀景台，眺望基隆外海，令人心胸開懷舒暢。",
      "Phone": "886-2-24287664",
      "Address": "基隆市安樂區基金一路208巷附近",
      "ZipCode": "204",
      "TravelInfo": "搭乘基隆市公車505、509號(經安一路)於「情人湖路口站」下車，上山步行約30分鐘即可抵達，或搭乘基隆市公車509號(經麥金路)於「情人湖站」下車即達。",
      "OpenTime": "開放式空間，無時間限制",
      "Picture": {},
      "MapUrl": "http://g.co/maps/up995",
      "Position": {
        "PositionLat": 25.156959533691406,
        "PositionLon": 121.70590209960938,
        "GeoHash": "wsqx17xtc"
      },
      "Class1": "遊憩類",
      "Class2": "自然風景類",
      "Class3": "生態類",
      "Level": "非古蹟",
      "ParkingInfo": "備停車場",
      "ParkingPosition": {},
      "TicketInfo": "免門票",
      "Keyword": "情人湖",
      "City": "基隆市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_382000000A_403149",
      "Name": "外木山濱海風景區",
      "DescriptionDetail": "外木山濱海風景區橫跨萬里和基隆，從新北市與基隆市的交界處「獅子公園」出發，這裡有停車場停車方便，沿著步道走，風景非常優美，且可推推車，很適合親子或白髮族。一側為開闊的海岸景觀，另一側則是翠綠山脈，往左望野柳地質景觀，往右可遠眺基隆嶼，步道有規劃完善的自行車步道，且是基隆市第一條觀光自行車步道，全長只有1.2公里的封閉型自行車觀光步道，在此步道內遊客可以安心悠閒的散步、慢跑或騎自行車，享受著迎風吹來陣陣的海風，欣賞遼闊大海，釋放平日的壓力。",
      "Description": "外木山濱海風景區橫跨萬里和基隆，從新北市與基隆市的交界處「獅子公園」出發，這裡有停車場停車方便，沿著步道走，風景非常優美，且可推推車，很適合親子或白髮族。一側為開闊的海岸景觀，另一側則是翠綠山脈，往左望野柳地質景觀，往右可遠眺基隆嶼，步道有規劃完善的自行車步道，且是基隆市第一條觀光自行車步道，全長只有1.2公里的封閉型自行車觀光步道，在此步道內遊客可以安心悠閒的散步、慢跑或騎自行車，享受著迎風吹來陣陣的海風，欣賞遼闊大海，釋放平日的壓力。",
      "Phone": "886-2-24633341",
      "Address": "基隆市中山區文化路168號",
      "ZipCode": "228",
      "OpenTime": "N/A",
      "Picture": {},
      "Position": {
        "PositionLat": 25.16356086730957,
        "PositionLon": 121.7271499633789,
        "GeoHash": "wsqx1uzh2"
      },
      "Class1": "自然風景類",
      "Class2": "遊憩類",
      "ParkingPosition": {},
      "City": "基隆市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    }
  ]
const test2 = [
    {
      "ID": "C1_315081500H_000009",
      "Name": "福德水車公園生態園區",
      "DescriptionDetail": "2006年3月11日開幕的福德水車園區，是三芝水車文化景觀中最大的水車園區，座落於三芝區鬧區南側，三芝遊客中心對面，佔地近0.6公頃。沿著環園步道，除了有以高架引水道空中給水以帶動水車運行的大型引導式木造水車之外，還有一座用來維護水源乾淨的沉砂池，可以欣賞到多樣化的水車景觀及隨著四季舞弄風情的繽紛植物。穿越紅色景觀橋，即可一覽八連溪兩岸風光。  此處結合『觀光』、『生態』、『健康』三大主題，不僅可享受山林鳥野間純淨的氣息，周圍所視更是盈盈綠意、處處生機。  如藝術品般散落於三芝各地的水車造景，靜靜緩慢地一格一格順水轉動著，不僅訴說著早期農業發展的歷程與痕跡，也多了一份靜謐和知性的氛圍。",
      "Phone": "886-2-86353640",
      "Address": "新北市三芝區三芝遊客中心旁(三芝遊客中心地址:臺北縣三芝區埔坪里埔頭坑164-2號)",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.24748992919922,
        "PositionLon": 121.50617218017578,
        "GeoHash": "wsqrsunj7"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002734",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 三芝鄉, test",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000013",
      "Name": "麟山鼻遊憩區",
      "DescriptionDetail": "與富貴角相對望，矗立白沙灣兩旁，由於八十萬年前大屯火山群的竹子火山爆發，而形成了向外海延伸的岬角，德茂里居民稱為「鼻尾鼻」或「鼻尾頭」，日治時期改名為「麟山鼻」，為大量火山遺跡「安山岩」所構成的區域，安山岩呈深黑色、質地堅硬，有稜有角的『風稜石』，則是麟山鼻步道上具代表性的地形景觀。  岩石節理發達的安山岩，在海浪經年累月的侵蝕及東北季風長年不斷的挾帶砂粒吹襲磨蝕之下，逐漸形成平坦的風蝕面，然後再隨著風向改變帶來不同角度的雕琢，擁有尖銳的稜角，因而稱為『風稜石』。佇足欣賞這些體積碩大且造形奇特的風稜石時，就彷彿聽見風與石的對話，令人驚訝於那份來自自然力量中，自始至終不曾改變的深刻與堅持。  另堪稱為麟山鼻的瑰寶--藻礁，是一個值得進行觀察的特殊地形景觀。有些藻類的生長條件需附著在穩固的岩石上，遍佈的安山岩理所當然的成為了最佳的選擇，隨著藻類的新生與死亡，一代代的交替生長，進而形成了岩石表面上，具有多層細薄石灰質的藻礁。此外，觀賞潮間帶的小生物也是遊憩麟山鼻的重點活動之一，透過事先查看潮汐及準備齊全的裝備，就能一享弄潮的樂趣，並可輕易在岩縫石塊中，發現難得的自然野趣。  目前規劃成的「麟山鼻遊憩區」，設有人行步道、木棧道設備等，除可欣賞海濱風景外，  更可觀察海中淺灘生態。  2007年8月上映的電影：「不能說的秘密」中有一幕男主角護送女主角回家的場景，即是在麟山鼻遊憩區自行車步道所拍攝。其中木棧道總長約600公尺；沿途海景秀麗，尤以微風吹拂木麻黃林、海風挑動銀浪時，最為動人，也因此吸引許多影迷探訪。",
      "Phone": "886-2-86355100",
      "Address": "新北市石門區德茂里下員坑(2號省道23公里處)",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.284669876098633,
        "PositionLon": 121.51334381103516,
        "GeoHash": "wsqrv4gmf"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002490",
      "ParkingPosition": {},
      "Keyword": "麟山鼻觀海步道",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000014",
      "Name": "白沙灣水域遊憩區",
      "DescriptionDetail": "白沙灣(台2線23公里處)是由麟山鼻與富貴角共同合抱而成的半月形天然海灣，綿延的白淨沙灘長約1公里，您可以邀三五好友漫步於景觀步道上，遠觀一望無際的絕美海景，渡過悠閒的午後時光；這裡也相當適合大小朋友親子共遊，一同逐浪、堆堡、享受海水的沁涼，讓心靈徹底放鬆，予人純淨自在的舒適感。  輕輕漫步在沙灘上，會為了眼前的蔚藍海色不捨離去，更因為能坐擁一灣細緻的貝殼沙而流連忘返，還有被白浪捲帶上岸的珊瑚礁和貝殼，在歷經長期不斷的沖刷擊碎之後，終成人們握在手中的浪漫與眷戀。一旦風起時，掌中的細沙就急著起舞，它們將依循著強勁海風的吹拂，堆疊出整齊美麗的波浪狀細紋，大自然獨特的藝術品讓人驚嘆不已。  如果與沙相約後，還有閒情，不妨拜訪同在這片沙地上的沙地植物，看看它們如何以自身絕技克服惡劣環境，尋求一線生機。多變的地貌及有趣的自然生態，豐富了這方海之角，靜待人們的到來與探索。如需獲知更詳盡的生態旅遊資訊，可就近前往白沙灣遊客中心諮詢，備有多樣化的旅遊資料供遊客索取，並提供多媒體放映解說服務。",
      "Phone": "886-2-86355100",
      "Address": "新北市石門區德茂里下員坑(2號省道23公里處)",
      "OpenTime": "五、六、十月AM9:00-PM17:00;七、八、九月AM9:00-PM18:00",
      "Picture": {},
      "Position": {
        "PositionLat": 25.28421974182129,
        "PositionLon": 121.51786804199219,
        "GeoHash": "wsqrv4ye7"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002491",
      "ParkingPosition": {},
      "Keyword": "白沙灣",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000015",
      "Name": "白沙灣遊客中心",
      "DescriptionDetail": "位於白沙灣入口旁的北海岸及觀音山國家風景區管理處，設有白沙灣遊客中心，於2002年正式成立，為台灣第11處國家風景區。整體建築不同於一般的設計規劃，建築層次與緩和的斜坡串連，將停車場、廣場與沙灘的活動相互融合，減低建築高度視覺，提供屋頂草地與平台的活動空間，改善人與地景及建築的傳統二元關係，讓建築像大樹岩石一樣融入地景，造型極具生態理念。  一進遊客中心，馬上就有親切熱情的服務人員向您招呼諮詢，讓來訪的遊客備感溫馨。這裡提供許多相關旅遊資料、出版品及多媒體放映解說服務，除了讓您更深入了解北海岸及觀音山外，同時也讓您的遊程更加盡興自在。",
      "Phone": "886-2-86355100",
      "Address": "新北市石門區德茂里下員坑33-6號",
      "OpenTime": "十月至四月AM9:00-PM17:00;五月至九月AM9:00-PM18:00",
      "Picture": {},
      "Position": {
        "PositionLat": 25.28399085998535,
        "PositionLon": 121.52015686035156,
        "GeoHash": "wsqrv6b3b"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002740",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 石門鄉, 北海岸及觀音山國家風景區管理處",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000016",
      "Name": "富貴角遊憩區",
      "DescriptionDetail": "舊名為「打賓」或「打鞭」的富貴角，於清乾隆27年(西元1762年)，荷蘭人法倫泰在其著作《新舊印度誌》中，將富貴角記為「hoek」，意思為海岬，後人便採其譯音稱此地為「富基角」，直到日治時期才更名為「富貴角」。  富貴角公園內，規劃有海濱人行步道，順著步道迎風前行，除了欣賞風稜石外，還可以看到由石門礁岸所形成的老梅海灣地形及沙丘等，當然還有因強風雕塑而成的風剪樹，與固守在沙丘上的沙灘植物。  「風剪樹」顧名思義，乃是因為受到強風作用，迎風那一面無法抵擋強風日夜吹襲，因此只能順著風的方向生長，久而久之，就形成了迎風面樹枝葉少，背風面枝葉繁茂的不平均狀態，而樹冠頂部的枝葉根本無法生長，就像是被大剪刀剪過一般，因此才被稱為風剪樹。",
      "Phone": "886-2-86355100",
      "Address": "新北市石門區富基里（2號省道25公里處，往富基漁港內進入）",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.292470932006836,
        "PositionLon": 121.53833770751953,
        "GeoHash": "wsqrvsme2"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002492",
      "ParkingPosition": {},
      "Keyword": "富貴角公園",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000020",
      "Name": "青山瀑布步道",
      "DescriptionDetail": "行經石門，除了沿著海岸線前行，一睹大自然造景的神奇變化之外，不妨就驅車向山，來一趟恬靜的山林之旅，享受遠離塵囂的舒服與自在。沿著台2線的公路行駛，眼前景象盡是碧海藍天，再依著標示約26公里處(老梅國小對面)右轉進入往青山瀑布的路標，轉入北17縣道後，瞬間眼前熟悉的蔚藍，有了急劇的轉變，迎面而來的會是一抹抹的油綠，隨即置身於起伏的丘陵中，這時您可看到成片依山勢而耕築的梯田。  高聳的竹子山，匯聚了山中的豐沛水量，水流順勢流經了具高度落差的溪谷斷層，於是就此形成了石門山林中的青山瀑布，高約8公尺，舊名尖山湖瀑布。想要造訪風景秀麗的青山瀑布，必須沿著當年為了灌溉梯田而修築的坎底寮圳，一路向上攀爬。循著水聲淙淙，緩坡前行，便能悠閒的漫步在步道上。環顧四週，有青山與老梅溪一路相伴，五節芒隨風搖曳成趣，還有各式生長姿態獨特的林木互為左右，時而可以回首海岸，看丘陵自山中起伏，舖陳梯田處處，享受登高賞景的快意；或者再向前行，轉個彎走入溪谷，沿溪踏石而行，體驗戲水的自然樂趣。這個位於陽明山國家公園境內的青山瀑布全程長1.3公里，路程約40分鐘。",
      "Phone": "886-2-86355100",
      "Address": "新北市石門區尖山湖",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.24043083190918,
        "PositionLon": 121.5663833618164,
        "GeoHash": "wsqrw6cun"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002495",
      "ParkingPosition": {},
      "Keyword": "青山瀑布步道",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000021",
      "Name": "老梅綠石槽",
      "DescriptionDetail": "位於北海岸石門區老梅里的綠石槽海岸，為全台唯一特殊景觀，美不勝收。「綠石槽」在地理名詞中，應稱為「潮溝」或「海蝕溝」，這些排列整齊的石槽，是由於大屯火山爆發後，遺留海岸邊的火山礁岩，在波浪長期的沖刷下，質地鬆軟的部份被侵蝕，留下較堅硬的部份而形成溝槽，  這種特殊的「石槽」地形景觀，在冬季東北季風盛行時，浪花滋潤了石槽的岩面，也開始滋生「石蓴」、「裂片石蓴」和「扁石髮」等綠色的海藻，等到四月份東北季風漸歇，石槽就長滿了一大片綠色的海藻，也形成令人驚嘆不已的「綠石槽」海岸景觀。  綠石槽只出現在四、五月份，隨後海藻就在夏日陽光的曝曬下而消失，這段短暫而美麗的季節中，經常吸引來自全台各地的專業攝影師來此捕捉美景及拍攝婚紗照。北觀處同時提醒民眾，綠石槽在遊客的踩踏下已面臨生存危機，所以希望遊客能留在沙灘上觀賞就好，不要踩到綠石槽的範圍，尤其綠石槽上方相當滑溜危險，踩踏上方萬一滑倒受傷，那就得不償失了。遊客前往當地拍照，需先上氣象局網站查詢每日石門地區的乾潮時間，才不致因海水漲潮淹沒石槽，而無法捕捉綠色海岸的美景。",
      "Phone": "886-2-86355100",
      "Address": "新北市石門區老梅社區沿海",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.29235076904297,
        "PositionLon": 121.54537200927734,
        "GeoHash": "wsqrvu6ds"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002497",
      "ParkingPosition": {},
      "Keyword": "老梅石槽",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000027",
      "Name": "中角沙珠灣",
      "DescriptionDetail": "位於台2線39公里處，為北海岸的衝浪專區。夏日炎炎，總是吸引許多衝浪好手前來此地進行衝浪活動，在廣闊的海水上享受馳騁海水的快感。  這裡除了可進行衝浪活動之外，還可以遠眺金山八景之一：「燭臺雙嶼」，海天一線的優美景致，總讓人能夠拋開煩憂忙碌，盡情沉浸在蔚藍海岸中。燭臺雙嶼可說是金山的代表景點，又稱為「夫妻石」，位於金山岬東側海面上，形狀有如兩個燭臺並列，其成因乃因地盤上升，由隆起的珊瑚礁岩所形成之海蝕岩柱，十分特別有趣。  從中角至永興漁港間，更整建有海濱公路停車場與賞景步道，讓遊客便於停車駐足沿線賞景，也可走走步道，眺望對面基隆嶼、野柳海岬及獅頭山燭臺雙嶼的地質美景。",
      "Phone": "886-2-24988980",
      "Address": "新北市金山區中角海灘",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.238950729370117,
        "PositionLon": 121.63436126708984,
        "GeoHash": "wsqrxfe7w"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002742",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 中角沙珠灣",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000030",
      "Name": "獅頭山公園",
      "DescriptionDetail": "地質及生態豐富的獅頭山，原名為金山中正公園，位於突出於海岸的金山海岬，由原來的軍事海防要地轉型為賞景觀光勝地，由於以前為軍事經常管制區，一般民眾不得而入，因而保存著許多自然原始的環境生態以及未遭污染破壞的海岸景觀。從獅頭山頂可以走濱海神秘步道通往水尾漁港，山頂的步道及砂岩山體下，保有四通八達的碉堡坑道、營房、砲台及2座懷念蔣介石的「介字亭」，保存良好的軍事建築彷彿無聲地訴說著當年枕戈待旦的英勇歷史。  獅頭山海拔高約70餘公尺，山上林木成蔭，春夏季節花木扶疏，鳥語花香。四處設有觀景涼亭，視野極佳，望東可見野柳岬，西邊則是磺港漁港與中角山海景，沿步道往北邊走去，有一座傳統式紅色涼亭-中正亭，北方海面可清楚望見著名的金山地標「燭臺雙嶼」。  位於北磺溪出口的磺港漁港，在清朝時期因運輸硫磺而得名，現今已規劃為漁港公園，每逢捕魚時節，入夜漁火點點，與星空相互輝映，甚為愜意。而水尾漁港沿岸平日風平浪靜，夜晚時海面如鏡，若逢月圓，皓月當空，映入海面時，波光盪漾，如詩如畫，也可一見金山八景之一的「水尾泛月」。  獅頭山儼然就是金山岬突出於北海岸的瞭望臺，左右各擁有一座漁港環抱，因本身居高臨下，若要盡得金山海岸景觀之美，一次飽覽三大奇景：燭台雙嶼、磺港漁火及水尾泛月，及探索特殊的軍事遺址，這裡實在是不容錯過的好地方。",
      "Phone": "886-2-24988980",
      "Address": "新北市金山區公園路",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.225969314575195,
        "PositionLon": 121.64604949951172,
        "GeoHash": "wsqx805zy"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002743",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 獅頭山公園",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000034",
      "Name": "慈護宮",
      "DescriptionDetail": "俗稱「金包里媽祖廟」，是金山最具規模的廟宇，主要供奉金面媽祖，是當地信仰中心，鄉人更尊稱為「大廟」。當地人相信摸龍柱會發財，所以龍柱的舌尖與圓球早被摸得光亮，媽祖兩旁的千里眼與順風耳手拿金元寶，象徵著招財進寶。  200年歷史的金山慈護宮，不只是北海岸最重要的媽祖廟，更因為一則民間傳說，而衍生了一段金山媽祖到野柳做客的神奇姻緣。相傳清嘉慶年間（1796-1820）有「金面媽祖」神尊漂流海上，後擱淺野柳海岸石洞（今尊稱為媽祖洞），為當地莊民奉祀，後因媽祖神跡屢現，靈驗異常，參拜祈求之人接踵而至，野柳莊民想興建大廟供奉，後於嘉慶14年（1809）歲次已巳，廟宇在金山竣建而成，命名「天后宮」，由野柳恭迎媽祖神尊鎮座奉祀。  失去了媽祖的野柳人，對於媽祖一直是念念不忘，卻也莫可奈何，最後和金山人幾經協商後，金山人決定每年請媽祖回到發現媽祖的海蝕洞中做客一天，以方便野柳人的祭拜，而這正是金山媽祖到野柳做客的主要理由。",
      "Phone": "886-2-24988980",
      "Address": "新北市金山區大同里金包里街10號(金山老街旁)",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.220199584960938,
        "PositionLon": 121.64010620117188,
        "GeoHash": "wsqrrzpw7"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002753",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 慈護宮",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000035",
      "Name": "金包里古道",
      "DescriptionDetail": "鄰近縣界附近的大油坑，是今日金包里魚路古道的入口，這裡位於磺溪的上游，如果沿陽金公路直接至上磺溪橋，可以見到橋下近似乳白色的溪水潺潺而流，是含有硫磺質的溫泉水。離上磺溪橋不遠設有停車場，由停車場前向上步行一公里處，有一座著名的許顏橋。  魚路古道是二次世界大戰期間擔魚人為獲取較高的利潤，鋌而走險，行走的古道。一般從金山磺港出發，經過承天宮和墓園後，進入老街，接著沿著魚路古道一路往陽明山而去，魚貨在士林、北投一帶販賣；回程經過大油坑，改成擔硫磺回金山。如此日復一日，代代相傳，往返魚路的魚販與商旅，留下了艱辛討生活的故事。  目前金包里古道已經被陽明山國家公園規劃成十二大步道之一。這條全長約4公里的古道，沿途一望無垠的如茵綠草，及綠樹成蔭的森林，是值得登山郊遊的好去處。",
      "Phone": "886-2-24988980",
      "Address": "陽金公路大油坑至八煙之間",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.227209091186523,
        "PositionLon": 121.64627075195312,
        "GeoHash": "wsqx80kp5"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002747",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 金包里古道",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000036",
      "Name": "金山舊機場遺址與李芑豐古宅",
      "DescriptionDetail": "從金山市區的幹道中山路向西北方向直行，經過磺溪橋有一座三界橋附近，擁有兩處可以短暫逗留一番的地方，一處是在左方路邊的機場遺址，當年日據時期曾經在這個地點建設小型軍機場，據說剛啟用不久就飛機失事，後來也沒有發揮太大的作用。如今現地還遺留有當年用來壓實地面的三具石造滾輪，由法鼓山文教基金會設立一座基台展示並提供導覽說明，而機場原址大部分早已成為農田，這裡位在重光六股花卉農業區內，是全國最大的杜鵑花花材供應地，一年的輸出量多達幾百萬株，陽明山的杜鵑大都是從這裡移植供應的。  另外從右邊田間迂迴而進，有一座百年古宅，堪稱金山當地最華麗的古厝，屋主當年在北台灣富甲一方，號稱李佈公。依照清朝制度，除了廟宇宗祠外，只有當官或中科舉的人家，才有資格建造燕尾裝飾的屋脊，這座李芑豐古宅可能是官宦世家，才能建造出如此華美大器的住宅；典型的三合院形式，格局方正的正屋，以及左右護龍，看來氣勢非凡，最特別的是前院外埕還保有目前台灣少見的半月形風水池!",
      "Phone": "886-2-24988980",
      "Address": "新北市金山區三界壇路",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.229429244995117,
        "PositionLon": 121.62020874023438,
        "GeoHash": "wsqrx8chh"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002752",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 金山舊機場遺址與李芑豐古宅",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000039",
      "Name": "金寶山與鄧麗君墓園 (鄧麗君紀念公園-筠園)",
      "DescriptionDetail": "親臨一趟金寶山，可能會對傳統印象中森然肅殺的墓園氣氛完全改觀，園區設計除了宗教性的需求外，還十分具有藝術氣息，像是「千佛石窟」就是由朱銘大師擘畫，集數十位優秀的雕刻師，耗費多年完成1千多尊的佛像。其他還有碑林區，也有陳列近代著名人物的雕像，如布袋戲大師李天祿、大導演胡金詮、以及政治人物盧修一等，將古今中外的傳奇人物以雕塑形式珍藏於此。  而享譽兩岸三地的歌星鄧麗君，也安葬在金寶山的墓園內-筠園。從入口前方的廣場中央開始，大型鋼琴鍵盤的石雕就能吸引遊客的目光，入口右方一小片花園中，還有一座鄧麗君歌唱神情的雕塑，彷彿其甜美悅耳的歌聲長存我們心中。長年絡繹不絕的歌迷或遊客總會來此表達思慕與追憶之情，可見鄧麗君並沒有被世人遺忘，再加上此處典雅大方的環境，確實是相得益彰。從視野開闊的筠園遠眺，金山海岸的美景盡收眼底，來到這裡更能體會金山的山水之美。",
      "Phone": "886-2-24985900",
      "Address": "新北市金山區西勢湖18號",
      "OpenTime": "AM8:00-PM17:00",
      "Picture": {},
      "Position": {
        "PositionLat": 25.248659133911133,
        "PositionLon": 121.60050201416016,
        "GeoHash": "wsqrxh6u1"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002750",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 金寶山與鄧麗君墓園 (鄧麗君紀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000051",
      "Name": "金包里老街",
      "DescriptionDetail": "金包里老街其實就是俗稱的金山老街，假日總是人山人海、遊客如織，店家生意興隆，各式當地小吃如卜肉、蚵仔酥，與金山特產像是芋餅與烤紅心蕃薯等都相當出名，還有老街中心的廣安宮廟口有最具人氣的鴨肉攤，自助式的端菜文化更形成本地特殊的景觀。  「金山老街」是北海岸唯一一條清代商業老街。清朝時期，老街繁華的程度如同現今商業大城，是當時往來雜沓的商業活動區域，走過一趟，可以發現老街保有許多過去繁華歷史所刻下的痕跡，鄰近慈護宮旁僅存的幾戶老房子，也就是舊時的「街屋」，傳統長形連棟式店舖住宅，有閩式建屋與洋樓立面，還有窄面進深的亭仔腳建物。街上唯一的一家舊式米店，百年的木板組合門面，方形大木缸裝承不同價格的米，以及舊式的磅秤，從敞開的門戶，可以看到幾位老人家閒坐聊天。隔壁是一家傳統中藥舖，看來歷經歲月的傢具與陳列的藥罐，猶留有清代的遺緒。  如今雖然繁榮光景已成過去，但經過完善的保存規劃，老街的觀光徒步區上還鋪設雕有金包里老街特色的排水溝蓋，創意的小巧思希望给大家更多驚喜，也能重溫過去的繁華風貌，細細品味這深具古早味的老街光景。",
      "Phone": "886-2-24988980",
      "Address": "新北市金山區金包里街",
      "OpenTime": "全年無休",
      "Picture": {},
      "Position": {
        "PositionLat": 25.2219295501709,
        "PositionLon": 121.63819122314453,
        "GeoHash": "wsqrrzw0r"
      },
      "Class1": "遊憩類",
      "Class2": "國家風景區類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04002746",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 金包里老街",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000142",
      "Name": "北海岸遊憩探索館",
      "DescriptionDetail": "認識探索館  以「驚奇探索、智識知性、閤家悠遊」為設計主軸，採用放大鏡透視北海岸的路、海、空特色，並以繽紛的色彩融合活潑童趣的手繪文字，吸引年輕族群與親子同遊。遊客可從館徽設計中，瞭解本館為提供遊客豐富多元知識的智庫，適宜闔家同遊體驗。  漫遊探索館        驚豔北海岸：透過立體互動地景模型，介紹交通、地景、生特等主題及遊程。      地景奇觀大探索：以FRP地面及女王頭模型，介紹海岸地質、地形及自然景觀，同時展現渾然天成的潮汐律動之美，喚起尊重環境、愛惜生態的意識。      深海奧秘大發現：以迷你潛艇搭載遊客探訪深海奧秘，在加上立體劇院、生態萬花筒，電子相簿及魚群互動投影等設施，充分體驗深海總動員的樂趣。      北海岸的知識叢林：藉由星空彩繪廊道的連結，將環境從海底回到陸地，以空中盤旋的鷹、窺視侯鳥的足跡櫥窗及互動電子書，協助了解北海岸及觀音山國家風景區豐富的陸空資源。      乘風破浪：該區有沖浪遊戲、鐵馬遊、遊艇體驗虛擬互動等大型遊憩體驗器材，並以豆腐岩、飛行傘、滑翔翼、燈塔及綠石槽等裝置藝術、深入體驗北海岸多樣化的旅遊生活。      藝術家的秘密基地：為多功能空間，運用陽光為概念元素，可作為教育活動的舉辦、藝術的傳承。空間位置上呈現日照燦爛，象徵北海岸地區人們的熱情與藝術文化陶冶下的樂活性格。",
      "Description": "以「驚奇探索、智識知性、閤家悠遊」為設計主軸，採用放大鏡透視北海岸的路、海、空特色，並以繽紛的色彩融合活潑童趣的手繪文字，吸引年輕族群與親子同遊。遊客可從館徽設計中，瞭解本館為提供遊客豐富多元知識的智庫，適宜闔家同遊體驗。",
      "Phone": "886-2-86355100",
      "Address": "新北市石門區德茂里下員坑33-6號",
      "ZipCode": "25341",
      "OpenTime": "每週二至週日09:00~17:00 (16:30為最晚入館時間)",
      "Picture": {},
      "Position": {
        "PositionLat": 25.284080505371094,
        "PositionLon": 121.51719665527344,
        "GeoHash": "wsqrv4y47"
      },
      "Class1": "生態類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04004318",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 石門鄉, 北海岸遊憩探索館",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    }
  ]
const test3 = [
    {
      "ID": "C1_315081500H_000148",
      "Name": "林梢步道",
      "DescriptionDetail": "林梢步道位於生態園區旁，沿山勢而建，猶如穿梭林間，漫步輕遊極為適意。步道分為兩段，中有茄苳園可供休憩，沿途視野良好，臺北盆地美景盡收眼底。",
      "Phone": "886-2-22928888",
      "Address": "新北市五股區凌雲路3段130號",
      "OpenTime": "全天開放",
      "Picture": {},
      "Position": {
        "PositionLat": 25.123210906982422,
        "PositionLon": 121.4264907836914,
        "GeoHash": "wsqqgjs16"
      },
      "Class1": "國家風景區類",
      "Class2": "遊憩類",
      "Class3": "自然風景類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04005035",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 觀音山 (五股鄉、八里鄉), 林梢步道",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081500H_000188",
      "Name": "金山萬里溫泉區",
      "DescriptionDetail": "金山萬里溫泉屬於大屯山地熱帶，得天獨厚的天然泉水與地熱景觀，每年冬季，許多人偕伴前往享受泡湯樂趣，金山、萬里不同的泉質，不僅能滋潤皮膚，促進血液循環，亦有美白之效。「泡溫泉，賞海景」是北海岸與觀音山最獨特的夢幻自然景觀。迎著冷冽的寒風，浸泡在熱呼呼的黃金湯中，讓全身每一個細胞暢開無阻。冬季，不妨走一趟金山、萬里，享受一趟溫暖的身心靈饗宴。",
      "Phone": "886-2-24988980",
      "Address": "新北市金山區/萬里加投",
      "OpenTime": "全天24小時，依各商家營業時間為準。",
      "Picture": {},
      "Position": {
        "PositionLat": 25.214780807495117,
        "PositionLon": 121.64221954345703,
        "GeoHash": "wsqx2n1nt"
      },
      "Class1": "遊憩類",
      "Class2": "溫泉類",
      "Class3": "溫泉類",
      "WebsiteUrl": "https://www.northguan-nsa.gov.tw/user/Article.aspx?Lang=1&SNo=04005472",
      "ParkingPosition": {},
      "Keyword": "北海岸及觀音山國家風景區入口網, 觀光資訊網, 魅力景點, 金山鄉, 金山萬里溫泉區",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000018",
      "Name": "南子吝步道",
      "DescriptionDetail": "若你喜歡山也喜歡海，那你一定要來這裡看看360度無敵山海絕美景觀。講「南子吝山」可能很多山友一時意會不過來，然而用台語說「湳仔面」就熟悉親切多了。沿著這條全長不到一公里的步道而上，儘管有些坡度但整體平穩好走，途中有座休憩觀景涼亭，是眺望無敵美景的最佳駐足點，登高後可飽覽南雅漁港聚落全景，遼闊的海灣小鎮景色、以及層層疊疊的翠綠山巒，絕對讓人大呼值得。除此之外，天氣晴朗時還可俯瞰南雅奇岩、鼻頭角、基隆山、基隆嶼、陰陽海等岬灣景觀，以及半屏山、無耳茶壺山的壯闊山警，東北角海岸之美一次盡收眼底。此處也是許多攝影迷駐足之處，每年的4~9月最適合到此拍攝南雅漁村日出晨曦與夕陽色溫的美照；秋冬之際，芒花盛開，漫天芒雪隨風飄搖，更是絕美浪漫。",
      "Phone": "886-2-24991115",
      "Address": "新北市瑞芳區",
      "TravelInfo": "1.\t基隆客運台灣好行黃金福隆線856(瑞芳火車站-福隆遊客中心)→南雅南新宮站下車。2.\t基隆客運791(國家新城-福隆)→南雅南新宮站下車。3.\t基隆客運886(瑞芳-和美國小)→南雅南新宮站下車。4.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→南雅站下車。5.\t新巴士F805(瑞芳-和美國小)→南雅里站下車。",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "俯瞰南雅漁村"
      },
      "Position": {
        "PositionLat": 25.120189666748047,
        "PositionLon": 121.88751983642578,
        "GeoHash": "wsqwvsgz9"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "免費參觀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000019",
      "Name": "鼻頭港服務區",
      "DescriptionDetail": "來到東北角風景線沿途的第一個停靠站-鼻頭港服務區，作為旅人短暫休息的中繼站，這裡除了設有餐飲區、廁所、涼亭及停車場等公共設施，更棒的是還有極佳的海景視野，遠道而來的旅人可以下車呼吸幾口新鮮的海風，找間生猛海鮮小攤或海產店，一邊大啖海鮮，一邊眺望遼闊大海，同時滿足視覺、味覺及嗅覺，「海味」十足。另外，也別忘了到觀景平台上觀浪賞景、享受海風，夏季輕波、冬季巨浪，四季皆有不同韻致。【注意】東北季風盛行期間(10月~3月)，易有長浪發生，為維護安全，請勿前往海邊進行相關遊憩，造成不便，敬請見諒。",
      "Phone": "886-2-24991190",
      "Address": "新北市瑞芳區鼻頭路",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "小涼亭"
      },
      "Position": {
        "PositionLat": 25.122779846191406,
        "PositionLon": 121.915771484375,
        "GeoHash": "wsqwym2qg"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "停車場收費標準-（入園停車未滿2小時者，以2小時計費） 大客車-50元/次、小客車：50元/次、機車：20元/次",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000020",
      "Name": "鼻頭龍洞地質公園",
      "DescriptionDetail": "不同的交錯層理、差異侵蝕，創造了地景的獨特與多樣，來一趟鼻頭龍洞地質公園，在令人嘆為觀止的天然地質教室上一堂寶貴的戶外生態課吧！歡迎到此尋訪，感受最原始的壯闊與感動純淨清澈的湛藍大海、豐富多樣的海蝕地形，包含海階、海蝕溝、海蝕崖、蜂窩岩、生痕化石，以及成片的蕈狀岩和豆腐岩等自然景觀，這裡可謂地質學家的研究天堂，如果你對地質頗有興趣，或喜歡觀賞飽經海蝕風刻的奇形紋理，感受大自然留下的歲月痕跡與鬼斧神工，一定不要錯過。 【注意】1.\t東北季風盛行期間(10月~3月)，易有長浪(瘋狗浪)發生，為維護安全，請勿前往海邊進行相關遊憩，造成不便，敬請見諒。2.\t本區進入須向管理處提出申請，僅供學術公務目的申請進入。",
      "Phone": "886-2-24991115",
      "Address": "新北市瑞芳區台2線85k",
      "TravelInfo": "火車：1.臺北火車站→基隆火車站→基隆客運（791）→鼻頭 2.瑞芳火車站→台灣好行黃金福隆線(856)→鼻頭 3.宜蘭線火車→福隆站→基隆客運（791）、台灣好行黃金福隆線(856)→鼻頭客運：瑞芳火車站→基隆客運（886）→鼻頭 臺北火車站北一門→國光客運(1811) →鼻頭 臺北火車站北一門→國光客運(1812) →鼻頭",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "地質解說教室"
      },
      "Position": {
        "PositionLat": 25.12122917175293,
        "PositionLon": 121.88710021972656,
        "GeoHash": "wsqwvt5mz"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "免費參觀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000021",
      "Name": "鼻頭角步道",
      "DescriptionDetail": "挑戰東北角小長城 收藏海天一線絕美景觀綿延翠綠的山際線、褐色的蜿蜒步道，再搭配藍天白雲及蔚藍汪洋，交織出如畫一般的美景，鼻頭角步道已成為北台灣熱門打卡景點之一，只要花點體力與耐心登高，各種角度的美照即垂手可得。但其實這裡早已是許多健行者的愛好的登山基地，全長約3.5公里的木棧步道，沿途可見壯闊的山海灣岬、奇幻的海蝕地形、磅礡的浪花拍岸、繁花似錦的海濱植物，更有360度登高望遠的視野，整個東北角海岸就在腳下，盡覽海天一色的壯觀奇景。若想細細品味鼻頭角步道的美麗，建議預留2~3小時，則可輕鬆漫步在層層山巒之中，欣賞依山傍海的遼闊美景，而無論何時到訪也都能發現這裡的種種風情：清晨時分，薄霧籠罩山間與步道，增添幾分神秘感；正午的豔陽高照讓藍天白雲與山海一景更為明亮，編織出如明信片般的絕美景緻；傍晚時分，暖黃夕陽灑下，吸引眾多攝影好手捕捉最後一道斜射光的日落美景。週末就出發，體驗這個絕對令人流連忘返、驚奇連連的台版小長城吧！【小提醒】1.\t鼻頭角(濱海線)步道僅供學術公務申請進入。2.\t鼻頭角步道燈塔線因地勢陡峭、目前岩層石風化龜裂嚴重，有土石崩落之危險，為維護遊客安全，暫時封閉不開放通行，鼻頭角燈塔亦不開放參觀。",
      "Phone": "886-2-24991115",
      "Address": "新北市瑞芳區鼻頭路",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "鼻頭角一隅"
      },
      "Position": {
        "PositionLat": 25.125280380249023,
        "PositionLon": 121.92143249511719,
        "GeoHash": "wsqwymumr"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "免費參觀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000055",
      "Name": "龍洞灣海洋公園",
      "DescriptionDetail": "在此遊玩一日，你會發現，這片海洋其實離你這麼近。炎炎夏日想帶全家大小親近海洋、消暑玩樂，這裡再適合不過了！園內的海洋戲水區及兒童水世界是直接抽取海水，是愛好玩水者和小朋友的天堂，可以在此戲水游泳、獨木舟及潛水，而清澈的海灣內有近百種魚類，可趁此機會和魚兒近距離接觸，徜徉於大海的溫柔懷抱；也可以到海景咖啡屋坐坐，一邊品嚐美食小點及香濃咖啡，一邊眺望龍洞灣美麗海景，遠離都市喧鬧，享受愜意；又或者也可藉東北角這塊瑰麗海岸，到地質解說教室和海濱生態教室來場戶外生態學習之旅，一覽豐富的地質景觀，探索多樣的潮間帶生態，和小朋友一起尋寶探險，發掘大海的美好。一整天玩累了，不妨讓心情沉澱休息一下，享受在接近黃昏時刻的絕美龍洞灣，靜看這片海景的光影變換，忘卻塵囂，享受大自然給我們的最頂級心靈SPA。【小提醒】1.\t本園區屬生態復育區，請勿攜帶撈網及捕撈用具進入園區。2.\t下水前請務必評估自身身體況，並注意戲水安全。3.\t鼻頭-龍洞地質公園濱海線管制進入中，請向管理處提出申請核可後進入。4.\t東北季風盛行期間(10月~3月)，易有長浪發生，為維護安全，請勿前往海",
      "Phone": "886-2-24909258",
      "Address": "新北市貢寮區龍洞街(台二線85公里處)",
      "TravelInfo": "1.\t基隆客運台灣好行黃金福隆線856(瑞芳火車站-福隆遊客中心)→龍洞灣公園站下車。2.\t基隆客運791(國家新城-福隆)→龍洞灣公園站下車。3.\t基隆客運886(瑞芳-和美國小)→龍洞灣公園站下車。4.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→龍洞公園站下車。5.\t新巴士F837(貢寮火車站-鼻頭里停車場)或F839(貢寮火車站-鼻頭角)→龍洞灣公",
      "OpenTime": "依龍洞灣海洋公園官網公布為準。",
      "Picture": {
        "PictureDescription1": "安全戲水"
      },
      "Position": {
        "PositionLat": 25.11819076538086,
        "PositionLon": 121.91764068603516,
        "GeoHash": "wsqwyk9sn"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "WebsiteUrl": "http://longdong-oceanpark.emmm.tw/?ptype=info",
      "ParkingPosition": {},
      "TicketInfo": "依龍洞灣海洋公園官網公布為準。",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000056",
      "Name": "龍洞四季灣",
      "DescriptionDetail": "春婚、夏陽、秋饌、冬湯。一座白色城堡比鄰著美麗海灣，是四季的憧憬，是與海的一場約會，或一場冒險。這裡充滿了浪漫、熱情的氣氛，純淨的白色建築在藍天碧海之間更顯夢幻，很有幸福感，海岸邊萬化變千的奇岩和綺麗景色，也吸引來自各地的旅遊玩家前來度假放鬆。一如這兒的名稱「四季灣」，四季皆有動人景致及不同玩法，春季時遠眺海洋中鯨豚遨遊的美姿，夏季體驗無邊際的海水泳池及出海船潛，秋季可上龍洞岬灣步道來趟知性樂活之旅，冬季時賞濤濤浪花，泡湯暖心也暖身。由天然海蝕平台改建而成的海水泳池與大海相通，擁有全視野無敵海景，清澈可見底的海面下，色彩艷麗的魚群隨海流飄舞，還有豐富的藻類貝類及珊物類等，可深深感受到這片水域的原始及迷人，更棒的是這個玩樂天堂還有國內少見的寵物游池，帶毛小孩去旅行清涼一夏也沒問題！身為首座結合遊艇港、海水游泳池及海洋解說展示館的度假勝地，一系列極致體驗早已等待遊客來親身探索，享受一場浪漫親海之旅，悠活在大自然懷抱中。【注意】東北季風盛行期間(10月~3月)，易有長浪發生，為維護安全，請勿前往海邊進行相關遊憩，造成不便，敬請見諒。",
      "Phone": "886-2-24901000",
      "Address": "新北市貢寮區和美街48號",
      "TravelInfo": "1.\t基隆客運台灣好行黃金福隆線856(瑞芳火車站-福隆遊客中心)→龍洞四季灣站下車。2.\t基隆客運791(國家新城-福隆)→龍洞南口海洋公園站下車。3.\t基隆客運886(瑞芳-和美國小)→龍洞南口海洋公園站下車。4.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→龍洞南口站下車。5.\t新巴士F837(貢寮火車站-鼻頭里停車場)或F839(貢寮火車站-鼻頭角",
      "OpenTime": "園區-09:00~18:00 / 水域-每年5月~9月9:00~17:30",
      "Picture": {
        "PictureDescription1": "地質景觀"
      },
      "Position": {
        "PositionLat": 25.101350784301758,
        "PositionLon": 121.91826629638672,
        "GeoHash": "wsqwy3d1v"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "WebsiteUrl": "http://www.kivano.com.tw/",
      "ParkingPosition": {},
      "TicketInfo": "依龍洞四季灣官網公布為準。",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000057",
      "Name": "龍洞灣岬步道",
      "DescriptionDetail": "走在斷崖峭壁步道中，一邊湛藍汪洋，一邊翠綠山巒，感動之情油然而生，也不禁驚嘆這如畫如詩的美景。龍洞一稱源自於此地海岸岩石彎弧如巨龍盤踞，灣岬步道串聯了東北角兩大岬角，也串起了鼻頭角600萬年與龍洞岬3500萬年這兩段不同時空故事，你會對大自然感到敬畏，對這片時空交織下的壯觀感到奧妙。 步道起點為西靈岩寺，數分鐘的路程即到達觀景平台，可在此觀海、聽浪、賞奇岩，因居高臨下更能清楚一覽壯麗海景及嶙峋峭壁，或許還會看到岸邊岩壁上有人正全副武裝、奮力向上攀爬，那裡是有名的龍洞岩場，吸引了愛好挑戰的國內外各地好手。 在短短2~3個小時裡，來往這裡彷彿穿行萬年，除了感受時間推移與大地運動的力量外，登高健行也讓人身心舒暢，山海交錯的壯觀美景更令人流連忘返，有空時來這裡走走，見證這個超越了時間與空間的古老且堅硬的岩層地質奇觀。 【小提醒】 步道起點為龍洞四季灣北側的西靈巖寺，可一路連接至龍洞灣海洋公園。從龍洞南口海洋公園至和美國小折返全程約需1.5小時；至龍洞灣公園折返，全程約需3小時，一路平坦好走，遊客可視天氣及體力自行安排路程。",
      "Description": "走在斷崖峭壁步道中，一邊湛藍汪洋，一邊翠綠山巒，感動之情油然而生，也不禁驚嘆這如畫如詩的美景。龍洞一稱源自於此地海岸岩石彎弧如巨龍盤踞，灣岬步道串聯了東北角兩大岬角，也串起了鼻頭角600萬年與龍洞岬3500萬年這兩段不同時空故事，你會對大自然感到敬畏，對這片時空交織下的壯觀感到奧妙。 步道起點為西靈岩寺，數分鐘的路程即到達觀景平台，可在此觀海、聽浪、賞奇岩，因居高臨下更能清楚一覽壯麗海景及嶙峋峭壁，或許還會看到岸邊岩壁上有人正全副武裝、奮力向上攀爬，那裡是有名的龍洞岩場，吸引了愛好挑戰的國內外各地好手。 在短短2~3個小時裡，來往這裡彷彿穿行萬年，除了感受時間推移與大地運動的力量外，登高健行也讓人身心舒暢，山海交錯的壯觀美景更令人流連忘返，有空時來這裡走走，見證這個超越了時間與空間的古老且堅硬的岩層地質奇觀。 【小提醒】 步道起點為龍洞四季灣北側的西靈巖寺，可一路連接至龍洞灣海洋公園。從龍",
      "Phone": "886-2-24991115",
      "Address": "新北市貢寮區東北角龍洞灣南岸",
      "TravelInfo": "客運：臺北火車站→臺北西A站→國光客運(1811) →龍洞南口海洋公園 臺北火車站→臺北西A站→國光客運(1812) →龍洞南口海洋公園火車：1.瑞芳火車站→台灣好行黃金福隆線(856)→龍洞南口海洋公園 2.臺北火車站→基隆火車站→基隆客運（791）→龍洞南口海洋公園 3.宜蘭線火車→福隆站→基隆客運（791）、台灣好行黃金福隆線(856)→龍洞南口海洋公園",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "龍洞灣岬步道"
      },
      "Position": {
        "PositionLat": 25.10512924194336,
        "PositionLon": 121.921142578125,
        "GeoHash": "wsqwy6hrb"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "免費參觀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000058",
      "Name": "龍洞岩場",
      "DescriptionDetail": "在東北角看多了奇岩怪石、海岸峭壁，還可換換另外一種玩法，挑戰自我！ 從看見岩縫中的固定點，就是挑戰之旅的開始，這裡的海岸岩壁由四稜砂岩構成，為五千萬年前華南古陸塊近海所沉積，除了是地質學家的研究天堂外，其堅硬緊實的岩性更是眾多國內外攀岩好手朝聖之地。幾近垂直的巨岩壁崖擁有渾然天成的壯觀氣勢，鮮明錯綜的節理紋路襯著一片大海無垠，這些平常用「看」、用「拍」的綺麗風景，攀岩愛好者們選擇用「親身」體驗來全力感受。這片全台灣最大最棒的天然岩場，等你來探險！ 【小提醒】 東北季風盛行期間(10月~3月)，易有長浪發生，為維護安全，請勿前往海邊進行相關遊憩，造成不便，敬請見諒。",
      "Description": "在東北角看多了奇岩怪石、海岸峭壁，還可換換另外一種玩法，挑戰自我！ 從看見岩縫中的固定點，就是挑戰之旅的開始，這裡的海岸岩壁由四稜砂岩構成，為五千萬年前華南古陸塊近海所沉積，除了是地質學家的研究天堂外，其堅硬緊實的岩性更是眾多國內外攀岩好手朝聖之地。幾近垂直的巨岩壁崖擁有渾然天成的壯觀氣勢，鮮明錯綜的節理紋路襯著一片大海無垠，這些平常用「看」、用「拍」的綺麗風景，攀岩愛好者們選擇用「親身」體驗來全力感受。這片全台灣最大最棒的天然岩場，等你來探險！ 【小提醒】 東北季風盛行期間(10月~3月)，易有長浪發生，為維護安全，請勿前往海邊進行相關遊憩，造成不便，敬請見諒。",
      "Phone": "886-2-24991115",
      "Address": "新北市貢寮區東北角龍洞灣南岸",
      "TravelInfo": "火車：1.瑞芳火車站→台灣好行黃金福隆線(856)→龍洞南口海洋公園 2.臺北火車站→基隆火車站→基隆客運（791）→龍洞南口海洋公園 3.宜蘭線火車→福隆站→基隆客運（791）、台灣好行黃金福隆線(856)→龍洞南口海洋公園客運：臺北火車站→臺北西A站→國光客運(1811) →龍洞南口海洋公園 臺北火車站→臺北西A站→國光客運(1812) →龍洞南口海洋公園",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "吳有倫-挑戰極限"
      },
      "Position": {
        "PositionLat": 25.113420486450195,
        "PositionLon": 121.92195129394531,
        "GeoHash": "wsqwy7ub7"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "免費參觀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000060",
      "Name": "澳底海鮮街",
      "DescriptionDetail": "艷陽高照的中午，除了躲進福隆週邊的餐廳店家避暑解餓，還有個美食聖地吸引眾多饕客驅車前往。 距離福隆約十分鐘的車程，澳底海鮮街短短的幾百公尺，卻有許多店家林立，但最多的還是各式新鮮海產，東北角潮間帶上海藻滋生，是眾多蝦蟹魚貝覓食繁衍的大本營，店家內的透明水族箱就是在告訴你現撈的新鮮！不論是蝦兵蟹將、軟絲花枝等烏賊家族、海中貴族九孔魷魚，還是本地大明星紅殼蝦蛄，都已準備好讓你嘗嘗他們的厲害。這裡不僅是釣客和衝浪玩家補充體力及品嘗美食之地，更有老饕們特地包車前來大啖當令鮮味。 看到這裡是不是已經食指大動，想馬上揪親朋好友出發了呢？歡迎來澳底這個鮮味十足的小漁村，一嚐東北角海岸所孕育出的天然美味！",
      "Description": "艷陽高照的中午，除了躲進福隆週邊的餐廳店家避暑解餓，還有個美食聖地吸引眾多饕客驅車前往。 距離福隆約十分鐘的車程，澳底海鮮街短短的幾百公尺，卻有許多店家林立，但最多的還是各式新鮮海產，東北角潮間帶上海藻滋生，是眾多蝦蟹魚貝覓食繁衍的大本營，店家內的透明水族箱就是在告訴你現撈的新鮮！不論是蝦兵蟹將、軟絲花枝等烏賊家族、海中貴族九孔魷魚，還是本地大明星紅殼蝦蛄，都已準備好讓你嘗嘗他們的厲害。這裡不僅是釣客和衝浪玩家補充體力及品嘗美食之地，更有老饕們特地包車前來大啖當令鮮味。 看到這裡是不是已經食指大動，想馬上揪親朋好友出發了呢？歡迎來澳底這個鮮味十足的小漁村，一嚐東北角海岸所孕育出的天然美味！",
      "Phone": "886-2-24991115",
      "Address": "新北市貢寮區真理里新港街",
      "TravelInfo": "1.\t基隆客運台灣好行黃金福隆線856(瑞芳火車站-福隆遊客中心)→澳底站下車。2.\t基隆客運791(國家新城-福隆)→澳底站下車。3.\t基隆客運887(和美-福隆)→澳底站下車。4.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→澳底站下車。5.\t新巴士F837(貢寮火車站-鼻頭里停車場)或F839(貢寮火車站-鼻頭角)→澳底國小站下車。",
      "OpenTime": "以各商家營業時間為準",
      "Picture": {},
      "Position": {
        "PositionLat": 25.054439544677734,
        "PositionLon": 121.92696380615234,
        "GeoHash": "wsqww9088"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "以各商家價目為準",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000061",
      "Name": "藍灣海濱遊憩園區",
      "DescriptionDetail": "相對於福隆海水浴場的交通方便，這裡需再搭乘大眾運輸或騎單車前往，卻也因此顯得更有秘境之感，你甚至可以期待獨享整片沙灘的舒適時光！ 藍灣海濱遊憩園區的金色沙灘綿延3公里，迄於福隆的黃金海岸，因此最棒的玩法就是租台單車，沿著平穩易騎的濱海自行車道，觀賞途中東北角特有的沙丘植物和波光嶙嶙的雙溪河，經過龍門吊橋一覽開闊視野後，就會到達目的地。園區內應有盡有，大小朋友最愛的海水浴場，其石英沙沙質柔軟細緻；還有生態步道、不定期的活動特展、烤肉區餐飲部、手作體驗及各式景觀藝術等，玩沙雕沙之外更有多種玩樂選擇。 你很難不注意到那座佇立於海灘旁的「鹽寮抗日紀念碑」，靜靜地訴說過往歷史。1895年乙未戰爭時，鹽寮為日軍登陸首站，大舉進據展開殖民統治史，並於此興建登陸紀念碑，臺灣光復後曾遭民眾搗毀，1975年則利用原有之碑座改建為現今的抗日紀念碑，紀錄這段抗日史事。 除了感受歷史情懷，不能錯過的還有這裡取之於自然的地景藝術，以黃金海岸結合沙雕、漂流木、鐵件、竹材及風鈴等自然元素，創作出一個個故事，也讓園區充滿原住民元素及濃濃的南洋風，而如想休憩解渴，也可到風格與眾不同的藍灣咖啡坐坐，在古色古香的彷閩式建築中啜飲咖啡及輕食，吹吹海風，享受這裡靜謐的一切。",
      "Description": "相對於福隆海水浴場的交通方便，這裡需再搭乘大眾運輸或騎單車前往，卻也因此顯得更有秘境之感，你甚至可以期待獨享整片沙灘的舒適時光！ 藍灣海濱遊憩園區的金色沙灘綿延3公里，迄於福隆的黃金海岸，因此最棒的玩法就是租台單車，沿著平穩易騎的濱海自行車道，觀賞途中東北角特有的沙丘植物和波光嶙嶙的雙溪河，經過龍門吊橋一覽開闊視野後，就會到達目的地。園區內應有盡有，大小朋友最愛的海水浴場，其石英沙沙質柔軟細緻；還有生態步道、不定期的活動特展、烤肉區餐飲部、手作體驗及各式景觀藝術等，玩沙雕沙之外更有多種玩樂選擇。 你很難不注意到那座佇立於海灘旁的「鹽寮抗日紀念碑」，靜靜地訴說過往歷史。1895年乙未戰爭時，鹽寮為日軍登陸首站，大舉進據展開殖民統治史，並於此興建登陸紀念碑，臺灣光復後曾遭民眾搗毀，1975年則利用原有之碑座改建為現今的抗日紀念碑，紀錄這段抗日史事。 除了感受歷史情懷，不能錯過的還有這裡取之於自",
      "Phone": "886-2-24901966",
      "Address": "新北市貢寮區研海街45號",
      "TravelInfo": "1.\t基隆客運台灣好行黃金福隆線856(瑞芳火車站-福隆遊客中心)→鹽寮站下車。2.\t基隆客運791(國家新城-福隆)→鹽寮站下車。3.\t基隆客運886(瑞芳-和美國小)→鹽寮站下車。4.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→鹽寮站下車。5.\t新巴士F837(貢寮火車站-鼻頭里停車場)或F839(貢寮火車站-鼻頭角)→鹽寮站下車。",
      "OpenTime": "09:00～17:00",
      "Picture": {
        "PictureDescription1": "鹽寮抗日紀念碑"
      },
      "Position": {
        "PositionLat": 25.04199981689453,
        "PositionLon": 121.92729949951172,
        "GeoHash": "wsqwqwb8p"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "WebsiteUrl": "http://www.bluebaypark.com.tw",
      "ParkingPosition": {},
      "TicketInfo": "依藍灣海濱遊憩園區官網公布為準",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000062",
      "Name": "龍門露營渡假基地",
      "DescriptionDetail": "如果崇尚自然、喜歡露營旅行，歡迎來到龍門露營度假基地，一處綠意盎然、山河環抱的大型度假園區，你可以在這裡露營、烤肉、跳塔打漆彈、散步騎單車，以及玩水泛舟等等，體驗重回大自然懷抱的樂趣 這裡的設備完善舒適，符合世界露營總會的標準，非常適合三五好友、全家大小及團體旅遊，而區內的河濱公園除了可垂釣外，不妨也安排獨木舟划船活動，悠遊水上！特別的是，這裡可划河又划海，雙溪河河域遼闊、水流平穩，是初次體驗新手的最愛；太平洋海域則是進階挑戰者的天堂，享受駕馭風浪，在海上越野冒險，且一年四季皆有不同樂趣，春天時，雙溪河畔野百合盛開，唯有划獨木舟才能觀賞百花綻放的美景；炎炎夏日，親朋好友一起划舟戲水打水仗，清涼又消暑；秋冬季節，候鳥過境，划舟至田寮洋賞鳥，則別有一番情趣。 找個假日規劃一個很不一樣的旅行，戶外露營、海邊走走、騎單車划獨木舟，呼吸新鮮空氣，讓大自然為你充充電。 推薦玩法： 若要規劃兩天一夜小旅行，第一天可在龍門度假基地園內安排整日的活動，第二天則可依個人喜好安排以下行程： 草嶺古道健身行：望遠坑口 &ndash; 雄碑虎字碑嶺頂淳涼亭 &ndash; 大里，全程約3小時 自行車消遙遊：租借單車從龍門公園騎乘至鹽寮濱公園，全程8公里，約需 1.5 小時 祈福靜心之旅：靈鷲山無生道場參佛祈福 / 眺望太平洋",
      "Description": "如果崇尚自然、喜歡露營旅行，歡迎來到龍門露營度假基地，一處綠意盎然、山河環抱的大型度假園區，你可以在這裡露營、烤肉、跳塔打漆彈、散步騎單車，以及玩水泛舟等等，體驗重回大自然懷抱的樂趣 這裡的設備完善舒適，符合世界露營總會的標準，非常適合三五好友、全家大小及團體旅遊，而區內的河濱公園除了可垂釣外，不妨也安排獨木舟划船活動，悠遊水上！特別的是，這裡可划河又划海，雙溪河河域遼闊、水流平穩，是初次體驗新手的最愛；太平洋海域則是進階挑戰者的天堂，享受駕馭風浪，在海上越野冒險，且一年四季皆有不同樂趣，春天時，雙溪河畔野百合盛開，唯有划獨木舟才能觀賞百花綻放的美景；炎炎夏日，親朋好友一起划舟戲水打水仗，清涼又消暑；秋冬季節，候鳥過境，划舟至田寮洋賞鳥，則別有一番情趣。 找個假日規劃一個很不一樣的旅行，戶外露營、海邊走走、騎單車划獨木舟，呼吸新鮮空氣，讓大自然為你充充電。 推薦玩法： 若要規劃兩天一夜小旅",
      "Phone": "886-2-24991791",
      "Address": "新北市貢寮區福隆里興隆街100號(臺二線100公里處)",
      "TravelInfo": "1.\t福隆火車站步行10分鐘2.\t基隆客運791(國家新城-福隆)→龍門營區站下車。3.\t基隆客運886(瑞芳-和美國小)→龍門營區站下車。4.\t國光客運1740(雙溪火車站-宜蘭轉運站)→露營區站下車。5.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→露營區站下車。",
      "OpenTime": "08:00-17:00",
      "Picture": {
        "PictureDescription1": "獨木舟活動"
      },
      "Position": {
        "PositionLat": 25.018980026245117,
        "PositionLon": 121.9385986328125,
        "GeoHash": "wsqwqf8fp"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "WebsiteUrl": "http://www.lonmen.tw/",
      "ParkingPosition": {},
      "TicketInfo": "依官網公布資訊為準",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000066",
      "Name": "卯澳漁村",
      "DescriptionDetail": "行經濱海公路旁，一個小而古老的漁村，一不小心就很容易被忽略，雖然看似不起眼，但她的傳統漁村風貌卻值得駐足、細細品味。進入漁村後即能感受這地方的古樸與幽靜，以及充滿無比平淡、悠閒的氛圍，歷經百年歲月變遷，卯澳漁村已褪去昔日繁華，返璞歸真，留下的是當地的石砌古厝及盤根錯節的百年老榕，伴隨著細碎的海潮聲，如今顯得特別寧靜而脫世。 漁村最具特色的「石頭古厝」是就地取材的最佳典範，砂岩、竹材或茅草皆是築屋的元素，早期村民興建石頭厝時都是由左鄰右舍互相幫忙來完成，唯一的花費就是打石師傅的工資了，通常我們可由石材加工的精緻以及石砌的形式來看出屋主的經濟能力，頗為有趣，也各有不同特色及美感。 卯澳前有大海，後有山巒，三條溪流匯集於此後入海，若從高處俯視灣澳，三溪形似「卯」字而得名。因得天獨厚的灣澳地形，這裡的海域型態多樣，海洋生物資源豐富，適合九孔、龍蝦、石花菜及各類海洋生物的生長，居住在這一帶的漁民依然保留傳統的漁撈技法，常常也可看到自家門前、廣場上曬海菜的景象，沿線走來，有如走進東北角海岸的漁家風情畫。 喜歡深掘在地特色的旅人，不妨來趟秘境漁村之旅，騎著單車沿著舊草嶺環狀線入村，在徐徐海風吹拂下，體驗這裡小而美的恬靜和質樸，感受這裡使人望塵出世的神秘魅力，享受一段悠閒舒適的寧靜時光。",
      "Description": "行經濱海公路旁，一個小而古老的漁村，一不小心就很容易被忽略，雖然看似不起眼，但她的傳統漁村風貌卻值得駐足、細細品味。進入漁村後即能感受這地方的古樸與幽靜，以及充滿無比平淡、悠閒的氛圍，歷經百年歲月變遷，卯澳漁村已褪去昔日繁華，返璞歸真，留下的是當地的石砌古厝及盤根錯節的百年老榕，伴隨著細碎的海潮聲，如今顯得特別寧靜而脫世。 漁村最具特色的「石頭古厝」是就地取材的最佳典範，砂岩、竹材或茅草皆是築屋的元素，早期村民興建石頭厝時都是由左鄰右舍互相幫忙來完成，唯一的花費就是打石師傅的工資了，通常我們可由石材加工的精緻以及石砌的形式來看出屋主的經濟能力，頗為有趣，也各有不同特色及美感。 卯澳前有大海，後有山巒，三條溪流匯集於此後入海，若從高處俯視灣澳，三溪形似「卯」字而得名。因得天獨厚的灣澳地形，這裡的海域型態多樣，海洋生物資源豐富，適合九孔、龍蝦、石花菜及各類海洋生物的生長，居住在這一帶的漁民依然",
      "Phone": "886-2-24991115",
      "Address": "新北市貢寮區福連里（濱海公路旁近三貂角）",
      "TravelInfo": "1.\t國光客運1740(雙溪火車站-宜蘭轉運站)→卯澳站下車。2.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→卯澳站下車。3.\t新巴士F831(貢寮火車站-鶯歌石)→卯澳市民活動中心站下車。",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "陳文欽-卯澳漁村"
      },
      "Position": {
        "PositionLat": 25.013450622558594,
        "PositionLon": 121.98931884765625,
        "GeoHash": "wsqwrctcv"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "免費參觀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    },
    {
      "ID": "C1_315081800H_000070",
      "Name": "萊萊地質區",
      "DescriptionDetail": "高手雲集的磯釣聖地 萊萊為東北角海岸海蝕平臺最發達的地區，因太平洋暖流經過，適合藻類和浮游生物生長，因此孕育出繁盛的魚類生態，再加上寬闊的海蝕平臺、單斜脊和礫灘，也成為了釣友互相切磋、享受釣魚樂趣的私房景點，無論晨昏皆可見高手雲集，歷來大規模磯釣比賽更是以此為競技場地。 萊萊地景饗宴-魔鬼的洗衣板、火龍岩傳說 除了是磯釣聖地，這裡形形色色的奇岩怪石與地形風貌更是令人嘖嘖稱奇，一路平行排列的黑色怪岩，條列行布於萊萊一帶，廣闊幽然的線型圖案與隨之而起的洶湧巨浪，使其有個響亮的名號－「魔鬼的洗衣板」；還有全台最大的「火龍岩」，外形彷彿潛入海中的龍露出的背脊，屹立於平坦的沈積岩平台，這些神奇的地質景觀皆是造山運動所留下的痕跡。而在此也可近距離觀覽大片海蝕溝和火山岩脈等磅礡景觀，亦可遠眺龜山島，欣賞絕美海景。北側的海蝕平台區，更是攝影人的最愛，因面向東方的日出方向，是攝影人晨拍的絕佳地點，也提醒旅人們，冬季風浪較大，無論是賞景、磯釣或是拍攝都要特別小心，注意自身安全！",
      "Description": "高手雲集的磯釣聖地 萊萊為東北角海岸海蝕平臺最發達的地區，因太平洋暖流經過，適合藻類和浮游生物生長，因此孕育出繁盛的魚類生態，再加上寬闊的海蝕平臺、單斜脊和礫灘，也成為了釣友互相切磋、享受釣魚樂趣的私房景點，無論晨昏皆可見高手雲集，歷來大規模磯釣比賽更是以此為競技場地。 萊萊地景饗宴-魔鬼的洗衣板、火龍岩傳說 除了是磯釣聖地，這裡形形色色的奇岩怪石與地形風貌更是令人嘖嘖稱奇，一路平行排列的黑色怪岩，條列行布於萊萊一帶，廣闊幽然的線型圖案與隨之而起的洶湧巨浪，使其有個響亮的名號－「魔鬼的洗衣板」；還有全台最大的「火龍岩」，外形彷彿潛入海中的龍露出的背脊，屹立於平坦的沈積岩平台，這些神奇的地質景觀皆是造山運動所留下的痕跡。而在此也可近距離觀覽大片海蝕溝和火山岩脈等磅礡景觀，亦可遠眺龜山島，欣賞絕美海景。北側的海蝕平台區，更是攝影人的最愛，因面向東方的日出方向，是攝影人晨拍的絕佳地點，也提醒旅人",
      "Phone": "886-3-9780727",
      "Address": "台2線110.4公里處",
      "TravelInfo": "1.\t國光客運1740(雙溪火車站-宜蘭轉運站)→萊萊站下車。2.\t國光客運1811(台北火車站-羅東)或1812(台北火車站-南方澳)→萊萊站下車。3.\t新巴士F831(貢寮火車站-鶯歌石)→萊萊站下車。",
      "OpenTime": "全年開放",
      "Picture": {
        "PictureDescription1": "魔鬼的洗衣板"
      },
      "Position": {
        "PositionLat": 25.003219604492188,
        "PositionLon": 122.00360107421875,
        "GeoHash": "wsqy0r8q3"
      },
      "Class1": "國家風景區類",
      "Class2": "國家風景區類",
      "Class3": "國家風景區類",
      "ParkingPosition": {},
      "TicketInfo": "免費參觀",
      "City": "新北市",
      "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
      "UpdateTime": "2021-04-03T01:33:07+08:00"
    }
  ]

const CityNames = [
    {'enName':'Keelung', 'name':'基隆'},
    {'enName':'NewTaipei', 'name':'新北'},
    {'enName':'Taipei', 'name':'台北'},
    {'enName':'Yilan', 'name':'宜蘭'},
    {'enName':'Taoyuan', 'name':'桃園'},
    {'enName':'Hsinchu', 'name':'新竹'},
    {'enName':'Miaoli', 'name':'苗栗'},
    {'enName':'Taichung', 'name':'台中'},
    {'enName':'Changhua', 'name':'彰化'},
    {'enName':'Nantou', 'name':'南投'},
    {'enName':'Yunlin', 'name':'雲林'},
    {'enName':'Chiayi', 'name':'嘉義'}, 
    {'enName':'Tainan', 'name':'台南'},
    {'enName':'Kaohsiung', 'name':'高雄'},
    {'enName':'Pingtung', 'name':'屏東'},
    {'enName':'Taitung', 'name':'台東'},
    {'enName':'Hualien', 'name':'花蓮'},
    {'enName':'Penghu', 'name':'澎湖'},
    {'enName':'Kinmen', 'name':'金門'},
    {'enName':'Lienchiang', 'name':'連江'},
]
const CityList = null
class SciencCity extends React.Component{
    constructor(props){
        super(props)
        this.state = {
            information:[],
            cityPoints:[]
        }
    }
    
    renderCityList = 
        CityNames.map((data, index) =>
            <ListGroup.Item key={index}><Link to={`${this.props.match.url}/${data.enName}`}>{data.name}</Link></ListGroup.Item>
        )

    render() {
        const {path, url} = this.props.match
        console.log(`path: ${path}`)
        console.log(`url ${url}`)
        return(
            <Container id="header">
                <Row>
                    <Col md={2}>
                       <ListGroup>
                            {this.renderCityList}
                        </ListGroup>
                    </Col>
                    <Col md={10}>
                        <Route path={`${path}/:city`}><Points /></Route>
                    </Col>
                </Row>
            </Container>
        )
    }
}

function Points(){
    let {city} = useParams()
    const [points, setPoints] = useState([])
    const [flag, setFlag] = useState(30)
    useEffect(() =>{
        // checkCity(city)
        setFlag(30)
        let active = true
      
        fetch(`https://ptx.transportdata.tw/MOTC/v2/Tourism/ScenicSpot/${city}?$top=${flag}`)
        .then(res => res.json())
        .then(data => {
            if(active){
                setPoints(data)
                setFlag(flag+30)
              }
        })
        .catch(err => console.log(err))

        window.addEventListener('scroll', isBottom)
        
        return() => {
            active = false
            window.removeEventListener('scroll', isBottom)
        }
    }, [city])  
    const isBottom = () =>{
        if(window.innerHeight + window.pageYOffset >= document.body.offsetHeight){
            fetch(`https://ptx.transportdata.tw/MOTC/v2/Tourism/ScenicSpot/${city}?$top=${flag+30}&$skip=${flag}`)
            .then(res => res.json())
            .then(data => {
                setPoints(points.concat(data))
                setFlag(flag+30)
            })
            .catch(err => console.log(err))
            // console.log("flag aft:", flag)
            // if(city == "New Taipei")
            //     setPoints(test2.concat(test3))
        }
            
    }
    const checkCity = c =>{
        console.log("City is", c)
        if(c == "Keelung")
                setPoints(test)
        else if(c == "NewTaipei")
                setPoints(test2)
        else
            setPoints([])
        console.log(points)
    }

    const renderPoints = 
            points.map((data, index) =>
            <tr key={index}>
                <td>{`${index+1}. `}{data.Name}</td>
            </tr>
        )
    const tableHeader = ()=> {
        const name = CityNames.map(data => {
            if(data.enName == city)
                return data.name
        })
        return(
            <thead>
                <tr>
                    <th>{name}的景點 : </th>
                </tr>
            </thead>
        )
    }
    return(
        <div>
            <Table>
                {points.length>1 ? tableHeader() : null}
                <tbody>
                    {city.length>0 ?renderPoints: null}
                </tbody>
            </Table>
        </div>
    )
}

export default SciencCity;