import React from 'react'
import {Table} from 'react-bootstrap'

const test = [
    {
         "ID": "C1_315080500H_000068",
         "Name": "紫坪",
         "DescriptionDetail": "紫坪位在綠島最南方，緊鄰「綠島露營區」。從露營區旁的步道，可通往海岸邊的潟湖「紫坪」。「紫坪」是一處由珊瑚礁構成的潮池，也是綠島著名的潟湖所在地，有全綠島最完整的潟湖地形以及珊瑚礁植群，更有茂盛的植物水芫花和珍貴的陸寄居蟹。外海儘管浪濤洶湧，內湖依然波平如鏡，宛若沉睡的湖水，清淺的躺在外珊瑚礁岩與內珊瑚貝砂灘間；水芫花灌叢身影倒映於平靜無波的水面上，潔白柔細的白砂鋪陳水底。熱帶海岸旖旎風情，盡在不言中。",
         "Description": "紫坪位在綠島最南方，從附近的步道，可通往海岸邊的潟湖。此處是由珊瑚礁構成的潮池，也是綠島著名的潟湖所在地，有全綠島最完整的潟湖地形以及珊瑚礁植群，更有茂盛的植物水芫花和珍貴的陸寄居蟹。",
         "Phone": "886-8-9672026",
         "Address": "臺東縣951綠島鄉溫泉路256號",
         "ZipCode": "951",
         "TravelInfo": "南下：於花蓮火車站前搭乘花蓮客運，往豐濱、靜浦，或是台東方向班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。北上：自台東火車站前搭乘台灣好行東部海岸線或鼎東客運海線班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。綠島：島上設有環島公車，搭乘公車至朝日溫泉下車，往前步行約5分鐘(查詢電話：089-672510)。。",
         "OpenTime": "全天候開放",
         "Picture": {
           "PictureUrl1": "https://www.eastcoast-nsa.gov.tw/image/419/640x480",
           "PictureDescription1": "從步道上遙望綠島露營區海邊"
         },
         "Position": {
           "PositionLat": 22.633939743041992,
           "PositionLon": 121.49990844726562,
           "GeoHash": "wsn2ub3s3"
         },
         "ParkingPosition": {},
         "TicketInfo": "免費，露營活動另計。",
         "Remarks": "1、紫坪上方的綠島露營區為生態保護區，禁止採集花木生物，並請維護環境整潔，讓這片美景能留與後代子孫。2、露營區目前已於2009年委由「東方之泉有限股份公司」經營，      聯絡電...",
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080500H_000073",
         "Name": "帆船鼻大草原",
         "DescriptionDetail": "由朝日溫泉售票口旁邊的小徑走進去，沿步道而上，就來到有「綠島地毯」之稱的帆船鼻草原。帆船鼻位於綠島東南角，平坦的海岬台地上綠草如茵，與四周的藍天碧海，構成看不到綠意與藍色盡頭的極佳的景緻，草原邊緣懸崖可以俯視朝日溫泉與海參坪，也是綠島居高臨下欣賞日出、月昇，沐浴海風的最佳景點之一。從帆船鼻往北眺望，遠處海參坪一帶的海崖及嵯峨奇岩，矗立海岸；近處能夠居高臨下俯視朝日溫泉的溫泉池及新穎的建築設施；往西為白沙灣的大片珊瑚裙礁，天氣晴朗時，南方海天交接處可見到蘭嶼，也是綠島極佳的日出賞景點，美妙景致讓人留連忘返。",
         "Description": "帆船鼻位於綠島東南角，有「綠島地毯」之稱，可由朝日溫泉售票口旁邊的小徑沿步道而上。由於地形突出，地勢又高出四周，屬東北季季風可長驅直入的衝風帶；再加上後天的放牧，遂形成低草原景觀。草原邊緣懸崖可以俯視朝日溫泉與海參坪，也是綠島居高臨下欣賞日出、月昇，沐浴海風的最佳景點之一，每年四、五月可觀賞到南十字星座丰采，每年春秋候更是賞鳥的極佳去處。",
         "Phone": "886-8-9672026",
         "Address": "臺東縣951綠島鄉溫泉路167號",
         "ZipCode": "951",
         "TravelInfo": "南下：於花蓮火車站前搭乘花蓮客運，往豐濱、靜浦或台東方向班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。北上：自台東火車站前搭乘台灣好行東部海岸線或鼎東客運海線班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。綠島：島上設有環島公車，搭乘公車至朝日溫泉下車，沿朝日溫泉售票口旁邊的小徑走進去(查詢電話：089-672510)。",
         "OpenTime": "全天候開放",
         "Picture": {
           "PictureUrl1": "https://www.eastcoast-nsa.gov.tw/image/29072/640x480",
           "PictureDescription1": "鳥瞰帆船鼻大草原"
         },
         "Position": {
           "PositionLat": 22.63365936279297,
           "PositionLon": 121.50689697265625,
           "GeoHash": "wsn2ubqde"
         },
         "ParkingPosition": {},
         "TicketInfo": "免費",
         "Remarks": "1、帆船鼻為凸出海岬，地勢極高且海風強勁，請注意不要靠懸崖太近，以策安全。2、愛護大自然生物，並請維護環境整潔。3、夏季日照與冬季寒風甚強，請預作防範。",
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080500H_000098",
         "Name": "哈巴狗與睡美人岩",
         "DescriptionDetail": "海參坪位於綠島東部海岸之中段的海灣，由於礁岸地形以及海水沖蝕作用，因此奇岩密佈、風景秀麗，吸引不少旅人前來探訪，走上有「小長城」之稱的步道，到觀海亭看著潔白的海浪沖刷著珊瑚裙礁月形海灣，或是眺望睡美人岩與哈巴狗岩，由綠地、沙灘、海灣、藍海組成的美景，讓人難以將目光移開，不斷讚嘆大自然的巧手，並留下片片美好的回憶。小長城步道長度：400公尺步行時間：來回約20分鐘小長城步道建在海參坪北側山坡上，沿著山稜蜿蜒而上的石階步道，遠看有如縮小版的萬里長城，走在這步道上，環顧四週美景，令人心曠神怡。而在海參坪的南方的海崖下，有一個獨立的海蝕柱，遠遠望去像是孔老夫子正面壁思過，因此名為「孔子岩」。",
         "Description": "睡美人岩與哈巴狗岩靜臥在海參坪上，是綠島最著名的景點之一，從小長城步道遠眺，可以見到睡美人靜靜地躺臥在海面上，白色的沙灘是她秀麗的長髮，而垂著長耳朵的哈巴狗靜臥在不遠處。天氣晴朗時，從遠處眺望哈巴狗與睡美人，可以有許多有趣的「錯位」拍攝玩法！堪稱是綠島最著名的景點。",
         "Phone": "886-8-9672026",
         "Address": "臺東縣951綠島鄉環島公路8公里處",
         "ZipCode": "951",
         "TravelInfo": "南下：於花蓮火車站前搭乘花蓮客運，往豐濱、靜浦或台東方向班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。北上：自台東火車站前搭乘台灣好行東部海岸線或鼎東客運海線班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。詳細時刻表及車資請洽花蓮客運(查詢電話：03-8338146~8)或鼎東客運海線(查詢電話：089-328629 / 089-333443) 綠島：島上...",
         "OpenTime": "全天候開放",
         "Picture": {
           "PictureUrl1": "https://www.eastcoast-nsa.gov.tw/image/29064/640x480",
           "PictureDescription1": "哈巴狗與睡美人岩的美麗海灣"
         },
         "Position": {
           "PositionLat": 22.655019760131836,
           "PositionLon": 121.509521484375,
           "GeoHash": "wsn2vh0x1"
         },
         "ParkingPosition": {},
         "TicketInfo": "免費",
         "Remarks": "1、愛護大自然生物，並請維護環境整潔。2、夏季日照與冬季寒風甚強，請預作防範",
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080500H_000167",
         "Name": "柴口浮潛區",
         "DescriptionDetail": "綠島主要的浮潛區有二處，分別為柴口與石朗，而柴口不僅十分適合新手來體驗浮潛，也是每年6-8月強勁的西南風吹臨綠島時，位在避風面的柴口是絕佳浮潛區。柴口以壯麗的石珊瑚景觀著稱，海水深淺變化具有層次感，讓人能夠盡情享受瑰麗的海底景觀。柴口潛水區近海與大礁石間的潮間帶，海域變化層次多，海底礁石林立，近岸海底和大礁石間為礁岩平台地形，覆蓋在礁石上以團塊和表覆形珊瑚群體等石珊瑚種類為主；浮潛完後，走在潛水步道上近距離觀察潮間帶生物，可找到海藻、海膽、海星的蹤影。早期開墾綠島的漢人曾與島上原住民族發生爭鬥，兩聚落於此地以木材築牆對峙，當時稱為柵口，後來隨著地方發展建設，才更名為「柴口」；從公館到柴口、中寮間的北海岸，是綠島海岸平原面積最廣的地方；海岸地形仍是以珊瑚裙礁為主體，柴口與中寮則是綠島砂丘孕育的最佳之處，也是綠島僅有的兩處沙灘之一。",
         "Description": "早期稱為柵口，後來更名為「柴口」，為綠島主要浮潛區之一。海岸地形以珊瑚裙礁為主體，是綠島僅有的兩處沙灘之一。 此為初級潛水區，觀光局東管理處在此設置潛水步道，方便潛水客或浮潛人士下水，保護石珊瑚，以免被人為破壞。適合每年六月至八月前來從事浮潛活動，海域變化層次多、海底礁石林立，浮潛完也可觀察潮間帶生物。",
         "Phone": "886-8-9672026",
         "Address": "臺東縣951綠島鄉環島公路2公里處",
         "ZipCode": "951",
         "TravelInfo": "北上：自台東火車站前搭乘台灣好行東部海岸線或鼎東客運海線班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。南下：於花蓮火車站前搭乘花蓮客運，往豐濱、靜浦或台東方向班車，在富岡漁港站下車後步行至富岡漁港，轉乘渡船前往綠島。詳細時刻表及車資請洽花蓮客運(查詢電話：03-8338146~8)或鼎東客運海線(查詢電話：089-328629 / 089-333443)綠島：島上環...",
         "OpenTime": "全天候開放",
         "Picture": {
           "PictureUrl1": "https://www.eastcoast-nsa.gov.tw/image/29042/640x480",
           "PictureDescription1": "柴口十分適合新手來體驗浮潛"
         },
         "Position": {
           "PositionLat": 22.677919387817383,
           "PositionLon": 121.48278045654297,
           "GeoHash": "wsn3h2mh3"
         },
         "ParkingPosition": {},
         "TicketInfo": "免費",
         "Remarks": "1.柴口有設置潛水步道，便利潛水客或浮潛者下水，保護其他地區的生態免受人類威脅。2.浮潛完，別忘了觀察潮間帶生物，可以看見海星、海膽、海藻的蹤影。3.綠島水域的潛點很多，環繞著島嶼...",
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080600H_000013",
         "Name": "西衛里˙塔尖",
         "DescriptionDetail": "石敢當外觀：塔型總　　高：9.98M圓 周 長：26.98M構建形式：圓錐形塔頂飾物：葫蘆西衛塔尖位於西衛里沿岸潮間帶上，是當地居民拾貝、採海菜的地區，早期因潮水洶湧流向通梁跨海大橋，居民擔憂對於村落有不良影響，故建塔治水收水煞，且鄰近西衛漁港，並有庇護漁船進出海域平安的功能。原為七層玄武岩造尖形塔，經過兩次整修為現今所見之九層(加上塔頂飾物)，故當地居民又稱九層塔。資料來源：西衛里地方耆老口述",
         "Description": "西衛塔尖位於西衛里沿岸潮間帶上，是當地居民拾貝、採海菜的地區，早期因潮水洶湧流向通梁跨海大橋，居民擔憂對於村落有不良影響，故建塔治水收水煞，且鄰近西衛漁港，並有庇護漁船進出海域平安的功能。原為七層玄武岩造尖形塔，經過兩次整修為現今所見之九層(加上塔頂飾物)，故當地居民又稱九層塔。資料來源：西衛里地方耆老口述",
         "Phone": "886-6-9216521",
         "Address": "澎湖縣馬公市西衛漁港北側，西衛里社區活動中心旁潮間帶",
         "ZipCode": "880",
         "OpenTime": "Sun 24 hours；Mon 24 hours；Tue 24 hours；Wed 24 hours；Thu 24 hours；Fri 24 hours；Sat 24 hours",
         "Picture": {},
         "Position": {
           "PositionLat": 23.581560134887695,
           "PositionLon": 119.5836410522461,
           "GeoHash": "wsjn1hyhs"
         },
         "Class1": "文化類",
         "Level": "非古蹟",
         "ParkingPosition": {},
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080600H_000043",
         "Name": "馬公港 漁人碼頭",
         "DescriptionDetail": "追星景點「力霸房屋 澎湖定居篇」廣告，年輕夫婦一開始所站立的地方是馬公第二漁港，延伸至馬公第一漁港是一條長長的木棧道，這裡就是漁人碼頭，早晚都有不少人悠閒散步著，在漁人碼頭中段的「菊島之星」，是一間船造型的漁產品直銷中心，可購買紀念品，附近商圈是品嚐澎湖海鮮漁產品的好地方。",
         "Description": "馬公第二漁港延伸至馬公第一漁港是一條長長的木棧道，這裡就是漁人碼頭，早晚都有不少人悠閒散步著，在漁人碼頭中段的「菊島之星」，是一間船造型的漁產品直銷中心，可購買紀念品，附近商圈是品嚐澎湖海鮮漁產品的好地方。",
         "Phone": "886-6-9216521",
         "Address": "澎湖縣馬公市澎湖縣馬公市臨海路",
         "ZipCode": "880",
         "OpenTime": "Sun 24 hours；Mon 24 hours；Tue 24 hours；Wed 24 hours；Thu 24 hours；Fri 24 hours；Sat 24 hours",
         "Picture": {
           "PictureUrl1": "https://www.penghu-nsa.gov.tw/FileDownload/TravelInformation/Big/20170905175023863889770.jpg",
           "PictureDescription1": "馬公漁港木棧道"
         },
         "MapUrl": "https://goo.gl/bJZG9p",
         "Position": {
           "PositionLat": 23.563730239868164,
           "PositionLon": 119.56816101074219,
           "GeoHash": "wsjn0cdus"
         },
         "Class1": "觀光工廠類",
         "Level": "非古蹟",
         "ParkingPosition": {},
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080600H_000058",
         "Name": "菜園休閒漁業區",
         "DescriptionDetail": "清代開墾初期，因地勢較低，水源豐沛且土壤肥沃，得以栽種一畝畝的綠色田園，因此以「菜園」命名。菜園位於馬公的東南方，緊臨青灣與測天島間的內灣，擁有豐富的海洋資源，經過人為開發後已成為多元化的生態園區，包含養殖漁業、溼地生態、珊瑚淺坪等。菜園漁港最大的產業特色是達60公頃面積的養殖漁業-牡蠣和近海箱網養殖，並已結合休閒觀光，發展出烤生蚵、餵海鱺等活動，讓遊客在海上體驗餵魚的樂趣，品嚐美味海鮮。玩家秘笈菜園休閒漁業區內有海上箱網養殖平台，開放給遊客前往垂釣跟餵魚，體驗澎湖漁民獨特的養殖方式，也享受跟魚群近距離接觸的樂趣。活動內容有牡蠣、箱網養殖生態解說，餵魚秀、海鱺/石斑/鯛魚拉力賽、趣鬥花枝或小管、餵食魟魚，無限量品嚐碳烤鮮蚵、海鮮粥或蚵仔麵線，菜園內灣活動安全性高(以業者現場公告為基準)。",
         "Description": "清代開墾初期，因地勢較低，水源豐沛且土壤肥沃，得以栽種一畝畝的綠色田園，因此以「菜園」命名。菜園位於馬公的東南方，緊臨青灣與測天島間的內灣，擁有豐富的海洋資源，經過人為開發後已成為多元化的生態園區，包含養殖漁業、溼地生態、珊瑚淺坪等。",
         "Phone": "886-6-9216521",
         "Address": "澎湖縣馬公市菜園里",
         "ZipCode": "880",
         "TravelInfo": "機車／汽車：自馬公市區經中華路，接縣道204至石泉國小右轉，205號縣道後左轉，看到「菜園生命公園」指標右轉，一小段路後即可到達。",
         "OpenTime": "Sun 24 hours；Sun 24 hours；Mon 24 hours；Mon 24 hours；Tue 24 hours；Tue 24 hours；Wed 24 hours；Wed 24 hours；Thu 24 hours；Thu 24 hours；Fri 24 hours；Fri 24 hours；Sat 24 hours；Sat 24 hours",
         "Picture": {},
         "Position": {
           "PositionLat": 23.55010986328125,
           "PositionLon": 119.59529876708984,
           "GeoHash": "wsjjcrntk"
         },
         "Class1": "文化類",
         "Level": "非古蹟",
         "ParkingPosition": {},
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080600H_000068",
         "Name": "隘門沙灘",
         "DescriptionDetail": "隘門沙灘由珊瑚與貝殼碎屑、孔蟲遺骸等組成，其中以星狀的有孔蟲最令遊客驚艷。原本默默無聞的隘門沙灘從民國87年開始，隘門村村長帶領兒子，自身做起了社區沙灘重整計畫，加裝攔沙網等設施，以攔截東北季風刮來的風砂，逐漸堆積而成。他們的努力終於獲得縣政府和澎湖國家風景區管理處的注意，撥下經費整建隘門沙灘，進而成為遊客青睞的美麗沙灘，夏季時分，隘門沙灘更成為水上活動玩家的好去處。追星景點澎湖最長的金黃貝殼沙灘，串連林投公園沙灘直達龍門港，是電視劇「菊島之戀」的拍攝地點。「菊島之戀」女主角在開往澎湖的船上，把寫滿心事的瓶中信丟向大海，十年後該瓶中信由來自日本的男孩帶回到菊島〈澎湖〉後，所衍生出的一段浪漫愛情故事。您可以來這綿延的沙灘尋找您的瓶中信或期待意想不到的發現。",
         "Description": "隘門沙灘與林投公園相比鄰，隘門沙灘由珊瑚與貝殼碎屑、孔蟲遺骸等組成，其中以星狀的有孔蟲最令遊客驚艷。原本默默無聞的隘門沙灘從民國87年開始，隘門村村長帶領兒子，自身做起了社區沙灘重整計畫，加裝攔沙網等設施，以攔截東北季風刮來的風砂，逐漸堆積而成。",
         "Phone": "886-6-9216521",
         "Address": "澎湖縣湖西鄉隘門村",
         "ZipCode": "885",
         "TravelInfo": "1. 機車／汽車：自馬公巿區出發，經中華路，接縣道204，經過澎湖遊客中心及機場，道路右側即有指標往隘門沙灘。2. 公車資訊：搭乘尖山線公車至隘門站下車後，步行15分鐘即可到達。3. 澎湖縣政府公共車船管理處公車時刻表連結",
         "OpenTime": "Sun 24 hours；Mon 24 hours；Tue 24 hours；Wed 24 hours；Thu 24 hours；Fri 24 hours；Sat 24 hours",
         "Picture": {
           "PictureUrl1": "https://www.penghu-nsa.gov.tw/FileDownload/TravelInformation/Big/20140821170840256.JPG",
           "PictureDescription1": "隘門沙灘放風箏",
           "PictureUrl2": "https://www.penghu-nsa.gov.tw/FileDownload/TravelInformation/Big/20170901114609523871725.jpg",
           "PictureDescription2": "澎湖最長的金黃貝殼沙灘是電視劇菊島之戀的拍攝地點"
         },
         "Position": {
           "PositionLat": 23.555389404296875,
           "PositionLon": 119.63928985595703,
           "GeoHash": "wsjn42nsj"
         },
         "Class1": "自然風景類",
         "Level": "非古蹟",
         "ParkingPosition": {},
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315080600H_000095",
         "Name": "雙心石滬",
         "DescriptionDetail": "石滬是先民智慧的展現，它是利用玄武岩和珊瑚礁所砌築的捕魚陷阱，而七美的'雙心石滬因造型浪漫，吸引眾多的情侶前來，儼然成為澎湖觀光的代表景點。雙心石滬是澎湖地區眾多石滬中，保留最完整的石滬，若要觀看雙心石滬必須先確認每日的退潮時間，才能順利看到完整的石滬雙心形狀。追星資訊雙心石滬、龍埕、燈塔等七美的各個景點，也是常在MV或廣告片出現，尤其是雙心石滬，劉燁「愛無界鎖定今生」、廣告片「 Canon EOS 650D -澎湖篇」，還有「原味的夏天」中爺爺的私生女去尋找她媽媽所遺留下來卡片中的場景，都是這兒。看看環景(Go)",
         "Description": "石滬是先民智慧的展現，它是利用玄武岩和珊瑚礁所砌築的捕魚陷阱。而七美的雙心石滬因造型浪漫，吸引眾多的情侶前來，儼然成為澎湖觀光的代表景點。",
         "Phone": "886-6-9972154",
         "Address": "澎湖縣七美鄉雙心石滬",
         "ZipCode": "883",
         "TravelInfo": "1. 七美遊客中心位於七美鄉南滬港旁，搭船前往七美鄉時，一下船即可看到七美遊客中心。2. 搭船的澎友，請自巿區南海遊艇碼頭（新營路25號）搭乘車管處交通船或民營快艇（僅旺季行駛）前往，船行時間約70分鐘（交通船約2小時）。3.選擇搭機，每日皆有德安航空往返馬公，七美和高雄間。4.澎湖縣政府公共車船管理處交通船時刻表連結5.德安航空連結",
         "OpenTime": "Sun 24 hours；Mon 24 hours；Tue 24 hours；Wed 24 hours；Thu 24 hours；Fri 24 hours；Sat 24 hours",
         "Picture": {},
         "Position": {
           "PositionLat": 23.2202205657959,
           "PositionLon": 119.44696807861328,
           "GeoHash": "wshun54es"
         },
         "Class1": "自然風景類",
         "Level": "非古蹟",
         "ParkingPosition": {},
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       },
       {
         "ID": "C1_315081000H_020180",
         "Name": "莒光遊客中心",
         "DescriptionDetail": "馬祖莒光鄉舊時稱白肯，因「肯」為福州話「犬」之擬音，又稱之為白犬，兩座島嶼山形像似兩隻小狗趴臥在海面上，因而稱東島為東犬島、西島為西犬島，1971年更名為莒光鄉，取其「毋忘在莒」之意，並改稱東莒、西莒，而莒光遊客中心就位在東莒島上福正聚落旁。仿閩東建築的遊客中心外觀，與周圍的燈塔、石頭屋融為一體，是棟相當有特色的建築，宛若度假中心一般的氣息，加上面海面山，視野俱佳，坐在遊客中心休息，閱讀旅遊資料，也成為一種享受；遊客中心內部不僅可以觀賞介紹影片，還提供遊玩資訊的諮詢，一旁設有福正藍眼淚驛站，供遊客休憩品嚐特色淡菜、紅糟雞料理，有機會到莒光走一遭，可別錯過這一站！",
         "Description": "馬祖莒光鄉舊時稱白肯，因「肯」為福州話「犬」之擬音，又稱之為白犬，兩座島嶼山形像似兩隻小狗趴臥在海面上，因而稱東島為東犬島、西島為西犬島，1971年更名為莒光鄉，取其「毋忘在莒」之意，並改稱東莒、西莒，而莒光遊客中心就位在東莒島上福正聚落旁。仿閩東建築的遊客中心外觀，與周圍的燈塔、石頭屋融為一體，是棟相當有特色的建築，宛若度假中心一般的氣息，加上面海面山，視野俱佳，坐在遊客中心休息，閱讀旅遊資料，也成為一種享受；遊客中心內部不僅可以觀賞介紹影片，還提供遊玩資訊的諮詢，一旁設有福正藍眼淚驛站，供遊客休憩品嚐特色淡菜、紅糟雞料理，有機會到莒光走一遭，可別錯過這一站！",
         "Phone": "886-836-89388",
         "Address": "連江縣莒光鄉福正村1號",
         "ZipCode": "21191",
         "OpenTime": "08:00-17:30",
         "Picture": {
           "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2813&w=1280&h=960",
           "PictureDescription1": "莒光遊客中心"
         },
         "Position": {
           "PositionLat": 25.961830139160156,
           "PositionLon": 119.98533630371094,
           "GeoHash": "wst7dq4ws"
         },
         "Class1": "生態類",
         "Class2": "國家風景區類",
         "Class3": "自然風景類",
         "ParkingPosition": {},
         "TicketInfo": "免費",
         "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
         "UpdateTime": "2021-04-03T01:33:07+08:00"
       }
     ]  

     const test2 = [
        {
          "ID": "C1_315081000H_020182",
          "Name": "福正聚落",
          "DescriptionDetail": "簡單樸實閩東風情 見證聚落遷徙 來到東莒島必訪景點－福正聚落，樸素景色令人印象深刻，在東莒當地有句俗諺：「夏福正，冬大浦」，由於大浦村位於南端，冬季時恰可抵禦東北風，而夏日吹西南風，東莒島北端的福正村最適人居，讓早期的東莒島民，就如同諺語所說，隨季節往返兩村港澳捕魚。 福正聚落曾經是東莒最繁華的村落，在漁獲量遞減，隨著居民移居和駐軍減少後，往日的榮景不再，獨留一幢幢殘缺的石屋與後方東莒島燈塔相伴，還有仍默默守護村莊的白馬尊王廟；村落的閩東建築形式多為簡單的二落水、亂石砌，與芹壁相比，又是另一種氛圍，聚落內僅約十戶人家居住，寧靜純樸，別有一番風味。 近年來，政府大力推動聚落保存，福正村從杳無人煙，逐漸恢復活絡，成為當地珍貴的文化遺產，人去樓空的景象或許引人惆悵，但它所散發的幽靜之美，卻是馬祖傳統聚落所獨具的人文氣息。 福正白馬尊王廟曠古風貌 走進福正聚落，有的是純樸幽靜之美，屋瓦磚牆在歲月雕琢下展現滄桑，遠遠望去，白馬尊王廟鮮豔的焰形封火山牆格外突出，據傳廟宇建於清朝道光年間，2000年時因建築構造陳舊，拆除重建，主祀神明白馬尊王及夫人、陪祀神臨水夫人及馬元帥，鎮守著村落。",
          "Description": "簡單樸實閩東風情 見證聚落遷徙 來到東莒島必訪景點－福正聚落，樸素景色令人印象深刻，在東莒當地有句俗諺：「夏福正，冬大浦」，由於大浦村位於南端，冬季時恰可抵禦東北風，而夏日吹西南風，東莒島北端的福正村最適人居，讓早期的東莒島民，就如同諺語所說，隨季節往返兩村港澳捕魚。 福正聚落曾經是東莒最繁華的村落，在漁獲量遞減，隨著居民移居和駐軍減少後，往日的榮景不再，獨留一幢幢殘缺的石屋與後方東犬燈塔相伴，還有仍默默守護村莊的白馬尊王廟；村落的閩東建築形式多為簡單的二落水、亂石砌，與芹壁相比，又是另一種氛圍，聚落內僅約十戶人家居住，寧靜純樸，別有一番風味。 近年來，政府大力推動聚落保存，福正村從杳無人煙，逐漸恢復活絡，成為當地珍貴的文化遺產，人去樓空的景象或許引人惆悵，但它所散發的幽靜之美，卻是馬祖傳統聚落所獨具的人文氣息。 福正白馬尊王廟曠古風貌 走進福正聚落，有的是純樸幽靜之美，屋瓦磚牆在歲月雕琢",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉福正聚落",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2815&w=1280&h=960",
            "PictureDescription1": "福正聚落"
          },
          "Position": {
            "PositionLat": 25.96324920654297,
            "PositionLon": 119.9867935180664,
            "GeoHash": "wst7dq7wy"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020183",
          "Name": "福正沙灘",
          "DescriptionDetail": "福正聚落前的美麗金黃沙灘 順著福正聚落裡的小徑走向海邊，會發現一抹潔白正在海陸交界處，隨著海風浪潮流轉靜臥，那正是被村落圍繞的福正沙灘。這裡海水清澈見底，遊客除了能欣賞蔚藍海景，也是藍眼淚季節時，東莒島上的追淚點之一，運氣好時，夜晚能看見藍色光帶隨著海浪波動，熠熠生輝。 福正沙灘是馬祖少見的沙岸地質景觀，細軟潔白的沙粒，正是人們體驗踏浪採蛤的最佳所在，夏天到東莒，可以忘情的倘佯在沙灘上，少有人干擾的天然游泳池，是消暑及放鬆心情的好去處，任憑浪花拍打在腳上，再搭配一旁絕佳的聚落風情，無疑是人生一大享受。 我家的冰箱在海邊－海中尋寶 福正沙灘同時也是東莒三寶之一－花蛤的產地，也有豐富的蚵、佛手、蠑螺等，潮間帶生態相當豐富，走在礫石岩塊之中，石塊堆隱身著各種螺貝朋友，沒有污染的海邊，處處都是新鮮食材，甚至有著「東莒的冰箱」美稱。",
          "Description": "福正聚落前的美麗金黃沙灘 順著福正聚落裡的小徑走向海邊，會發現一抹潔白正在海陸交界處，隨著海風浪潮流轉靜臥，那正是被村落圍繞的福正沙灘。這裡海水清澈見底，遊客除了能欣賞蔚藍海景，也是藍眼淚季節時，東莒島上的追淚點之一，運氣好時，夜晚能看見藍色光帶隨著海浪波動，熠熠生輝。 福正沙灘是馬祖少見的沙岸地質景觀，細軟潔白的沙粒，正是人們體驗踏浪採蛤的最佳所在，夏天到東莒，可以忘情的倘佯在沙灘上，少有人干擾的天然游泳池，是消暑及放鬆心情的好去處，任憑浪花拍打在腳上，再搭配一旁絕佳的聚落風情，無疑是人生一大享受。 我家的冰箱在海邊－海中尋寶 福正沙灘同時也是東莒三寶之一－花蛤的產地，也有豐富的蚵、佛手、蠑螺等，潮間帶生態相當豐富，走在礫石岩塊之中，石塊堆隱身著各種螺貝朋友，沒有污染的海邊，處處都是新鮮食材，甚至有著「東莒的冰箱」美稱。",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉福正沙灘",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2825&w=1280&h=960",
            "PictureDescription1": "福正沙灘"
          },
          "Position": {
            "PositionLat": 25.96324920654297,
            "PositionLon": 119.9867935180664,
            "GeoHash": "wst7dq7wy"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020184",
          "Name": "東莒島燈塔(東犬燈塔)",
          "DescriptionDetail": "碧海藍天下走過百年歲月的潔白燈塔 東莒島燈塔，又名「東莒島燈塔」，位在東莒島的東北方，清朝因鴉片戰爭失利，與英國簽訂南京條約開放沿海通商，為便於辨別福州方位，同治年間又應英人要求興建燈塔，造建於清同治11年（1872年），在此歷史背景下，東莒島燈塔於焉誕生。東莒島燈塔於1988年被內政部評定為台閩地區第二級古蹟，是台灣第一座使用花崗岩建造的燈塔，外觀漆成雪白色，燈塔的高度約19.5公尺，光源經過蚌型水晶透鏡折射後，光程可遠達16.7浬（約31公里）。 東莒島燈塔靜靜在東莒島服勤超過百年，每天夜裡固定閃爍著一長兩短的燈號，最特別的地方，就是在連接燈塔與辦公室的草地上，築有一道長達30公尺的白色防風矮牆，主因是東莒島燈塔位處高地，風勢強勁，這道防風牆可以讓工作人員在強風吹襲時，低身快速通過，讓古時工作人員手上的煤油燈不會被吹熄。 白毛城－燈塔文物展示館 2008年6月開放的燈塔文物展示館有一片長長的白色防風牆，當地居民稱此地為「白毛城」，屬於英式建築，館藏豐富的燈塔文物，增添了燈塔旅遊的豐富性，是不容錯過的遊覽重點。 東莒大砲連 藍眼淚追淚熱點之一 與東莒島燈塔相連的大砲連，以前曾是軍事重地，順著海岸線綿延數百公尺的營區，建有碉堡、榴砲等，如今成為馬祖軍事景點，開放讓遊客參觀，沿著木柵欄圍出的步道向前行至盡頭的小平台，更是夜間觀賞藍眼淚的私房景點之一呢！ 備註：東莒島多礁岩地形，夜晚光線不足易發生危險，切勿獨自前往並建議由導遊陪同觀賞藍眼淚。",
          "Description": "碧海藍天下走過百年歲月的潔白燈塔 東莒島燈塔，又名「東犬燈塔」，位在東莒島的東北方，清朝因鴉片戰爭失利，與英國簽訂南京條約開放沿海通商，為便於辨別福州方位，同治年間又應英人要求興建燈塔，造建於清同治11年（1872年），在此歷史背景下，東莒島燈塔於焉誕生。東莒島燈塔於1988年被內政部評定為台閩地區第二級古蹟，是台灣第一座使用花崗岩建造的燈塔，外觀漆成雪白色，燈塔的高度約19.5公尺，光源經過蚌型水晶透鏡折射後，光程可遠達16.7浬（約31公里）。 東莒島燈塔靜靜在東莒島服勤超過百年，每天夜裡固定閃爍著一長兩短的燈號，最特別的地方，就是在連接燈塔與辦公室的草地上，築有一道長達30公尺的白色防風矮牆，主因是東莒島燈塔位處高地，風勢強勁，這道防風牆可以讓工作人員在強風吹襲時，低身快速通過，讓古時工作人員手上的煤油燈不會被吹熄。 白毛城－燈塔文物展示館 2008年6月開放的燈塔文物展示館有一片長",
          "Phone": "886-836-88283",
          "Address": "連江縣莒光鄉福正村56號之1",
          "ZipCode": "21191",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2834&w=1280&h=960",
            "PictureDescription1": "東莒島燈塔(東犬燈塔)"
          },
          "Position": {
            "PositionLat": 25.964040756225586,
            "PositionLon": 119.9905776977539,
            "GeoHash": "wst7dqw7r"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020185",
          "Name": "神祕小海灣",
          "DescriptionDetail": "療癒系的神秘海岸 神祕小海灣位於福正聚落通往大浦聚落途中的澳口，是最近幾年才被命名的新景點，一望無際的遼闊大海，讓人心胸變得無限寬廣。在藍眼淚好發季節時，這裡也是東莒島追淚熱點之一，可以從高處欣賞峽灣中的大片藍色螢光。 從某個角度望去，海灣海蝕柱與海蝕溝充滿著想像的空間，因此民間流傳了呂洞賓與何仙姑在此得道成仙的浪漫故事，故又名「呂何崖」；平台右下方，有一平衡岩，傳說是玉帝的玉璽，為了鎮住呂何二仙所擺放，往平台右方遠眺山稜線，又酷似一隻石獅看守玉璽，石獅下方海平面上有一尖銳之海蝕柱，漲潮時像一隻鯊魚，退潮時又像一隻犀牛與石獅緊緊相伴。 海灣東上方有一坑洞，居民稱之為「燕巢」，是鳥類聚集之處，曾經有電視台探險節目一行人，冒險進入拍攝洞內景觀，該洞穴可以通往海邊，早年是採蚵者的捷徑。據說昔日馬祖列島海盜橫行，這裡曾經是島上民眾躲避海盜的最佳藏身之處，由於坑洞內尚遺留砲彈殼及未爆彈，建議遊客切勿冒險進入。",
          "Description": "療癒系的神秘海岸 神祕小海灣位於福正聚落通往大浦聚落途中的澳口，是最近幾年才被命名的新景點，一望無際的遼闊大海，讓人心胸變得無限寬廣。在藍眼淚好發季節時，這裡也是東莒島追淚熱點之一，可以從高處欣賞峽灣中的大片藍色螢光。 從某個角度望去，海灣海蝕柱與海蝕溝充滿著想像的空間，因此民間流傳了呂洞賓與何仙姑在此得道成仙的浪漫故事，故又名「呂何崖」；平台右下方，有一平衡岩，傳說是玉帝的玉璽，為了鎮住呂何二仙所擺放，往平台右方遠眺山稜線，又酷似一隻石獅看守玉璽，石獅下方海平面上有一尖銳之海蝕柱，漲潮時像一隻鯊魚，退潮時又像一隻犀牛與石獅緊緊相伴。 海灣東上方有一坑洞，居民稱之為「燕巢」，是鳥類聚集之處，曾經有電視台探險節目一行人，冒險進入拍攝洞內景觀，該洞穴可以通往海邊，早年是採蚵者的捷徑。據說昔日馬祖列島海盜橫行，這裡曾經是島上民眾躲避海盜的最佳藏身之處，由於坑洞內尚遺留砲彈殼及未爆彈，建議遊客切勿",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉神秘小海灣",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2839&w=1280&h=960",
            "PictureDescription1": "神祕小海灣"
          },
          "Position": {
            "PositionLat": 25.956680297851562,
            "PositionLon": 119.98236846923828,
            "GeoHash": "wst7dm22x"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020186",
          "Name": "大浦聚落",
          "DescriptionDetail": "東莒必備的古宅行旅 到東莒，看老房子絕對是必備的行程，除燈塔下方的福正聚落，在大埔石刻旁的大浦聚落亦值得一看。 福州語「浦」為小港灣之意，大浦聚落澳口朝南，曾經是東莒僅次於福正的第二大傳統漁村，全盛時有50多戶人家、200多位居民，港內停泊數十艘大大小小漁船，人丁興旺；附近海域早期盛產黃魚、鯧魚與帶魚，可謂天然港灣，加上聚落對面之「對面山」（又稱樓仔頂）正好可以阻擋冬季北風的入侵，故島上的居民，常依經驗法則順應季風變化改變漁作澳口，因而有「夏福正，冬大浦」的居住慣例。 自從1992年戰地解除、漁獲驟減後，人口逐漸外移，大浦聚落甚至成為一處只剩鬼神、不見人影的雜草蔓生禁地，昔日漁村榮景已成追憶；直至近十年，在有心人士與政府部落活化政策合作下，新住民與藝術家進駐，修屋築牆、活化老屋、帶動生氣，漸漸開始有居民回歸，有民宿、有遊客，讓大浦重生。 大浦東洋山遼闊景色 站在大浦聚落的岬角觀景台，這裡視野遼闊，是觀賞林坳嶼的最佳景點，沿大浦路東北行，一到靶場折向東，便接上新闢的東洋山步道，東洋山步道與北竿螺蚌山自然步道堪稱馬祖步道二絕，展現的都是壯闊的氣度。",
          "Description": "東莒必備的古宅行旅 到東莒，看老房子絕對是必備的行程，除燈塔下方的福正聚落，在大埔石刻旁的大浦聚落亦值得一看。 福州語「浦」為小港灣之意，大浦聚落澳口朝南，曾經是東莒僅次於福正的第二大傳統漁村，全盛時有50多戶人家、200多位居民，港內停泊數十艘大大小小漁船，人丁興旺；附近海域早期盛產黃魚、鯧魚與帶魚，可謂天然港灣，加上聚落對面之「對面山」（又稱樓仔頂）正好可以阻擋冬季北風的入侵，故島上的居民，常依經驗法則順應季風變化改變漁作澳口，因而有「夏福正，冬大浦」的居住慣例。 自從1992年戰地解除、漁獲驟減後，人口逐漸外移，大浦聚落甚至成為一處只剩鬼神、不見人影的雜草蔓生禁地，昔日漁村榮景已成追憶；直至近十年，在有心人士與政府部落活化政策合作下，新住民與藝術家進駐，修屋築牆、活化老屋、帶動生氣，漸漸開始有居民回歸，有民宿、有遊客，讓大浦重生。 大浦東洋山遼闊景色 站在大浦聚落的岬角觀景台，這裡視",
          "Phone": "886-836-88024",
          "Address": "連江縣莒光鄉大浦聚落",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2848&w=1280&h=960",
            "PictureDescription1": "大浦聚落"
          },
          "Position": {
            "PositionLat": 25.951820373535156,
            "PositionLon": 119.97691345214844,
            "GeoHash": "wst7dhks2"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020189",
          "Name": "大埔石刻",
          "DescriptionDetail": "記載功績的重要歷史遺跡 大埔石刻是台閩地區三級古蹟，位於東莒島的最南端，在1953年被國軍發現，並為了避免古蹟受損，建有懷古亭作為保護；岩盤碑文記載了明萬曆年間沈有容將軍在東莒不傷一兵一卒，即捉拿倭寇69名的豐功偉績，字跡出自當時工部右侍郎董應舉題文，為馬祖早期倭寇猖獗的歷史，留下珍貴見證。 從大埔石刻往前望去，可見圍繞在海中的軌條砦，踩著木棧道走下海邊一探，礁石嶙峋，別有洞天。 大埔石刻不僅記載著名將沈有容輝煌的戰功，當地民眾更相傳，大埔石刻本身就是一張藏寶圖，如果能破解字裡行間的暗示，就可以找到隱藏在東莒島某處的寶藏，各位遊客前往大埔石刻參觀時，不妨動動腦囉！ 備註：提醒遊客木棧道鄰近海邊，長期風蝕雨淋日曝，行走時請小心慢行，海邊礁石區遊玩時，應留意潮汐，注意安全。",
          "Description": "記載功績的重要歷史遺跡 大埔石刻是台閩地區三級古蹟，位於東莒島的最南端，在1953年被國軍發現，並為了避免古蹟受損，建有懷古亭作為保護；岩盤碑文記載了明萬曆年間沈有容將軍在東莒不傷一兵一卒，即捉拿倭寇69名的豐功偉績，字跡出自當時工部右侍郎董應舉題文，為馬祖早期倭寇猖獗的歷史，留下珍貴見證。 從大埔石刻往前望去，可見圍繞在海中的軌條砦，踩著木棧道走下海邊一探，礁石嶙峋，別有洞天。 大埔石刻不僅記載著名將沈有容輝煌的戰功，當地民眾更相傳，大埔石刻本身就是一張藏寶圖，如果能破解字裡行間的暗示，就可以找到隱藏在東莒島某處的寶藏，各位遊客前往大埔石刻參觀時，不妨動動腦囉！ 備註：提醒遊客木棧道鄰近海邊，長期風蝕雨淋日曝，行走時請小心慢行，海邊礁石區遊玩時，應留意潮汐，注意安全。",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉大埔石刻",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2867&w=1280&h=960",
            "PictureDescription1": "大埔石刻"
          },
          "Position": {
            "PositionLat": 25.946449279785156,
            "PositionLon": 119.9671401977539,
            "GeoHash": "wst79gmmh"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020190",
          "Name": "林坳嶼",
          "DescriptionDetail": "馬祖列島的極南點 從大浦聚落往南側望去，海面不遠處有座孤島，名為「林坳嶼」，是東莒島週邊的三座小島之一，也是馬祖列島的極南點；有別於北側的西牛嶼退潮時會形成連結東莒島之潮間帶，林坳嶼終年與東莒島遙遙相望，無法直接與東莒島相連。 林坳嶼島上有各種奇形怪石、植物生態資源豐富，根據植物專家調查表示，島上之多年生濱柃木深具觀賞價值；另島上怪石林立，饒富神話故事傳奇，目前尚未開放登島，僅有部分釣友會前往林坳嶼進行垂釣，是東莒島的主要釣場之一，也是釣友兵家必爭之地。 馬祖地質公園縣定自然地景之一 由於林坳嶼的特殊地質以及豐富的植物生態，2018年時被劃定為縣定自然地景，是馬祖地質公園十大地區域之一。",
          "Description": "馬祖列島的極南點 從大浦聚落往南側望去，海面不遠處有座孤島，名為「林坳嶼」，是東莒島週邊的三座小島之一，也是馬祖列島的極南點；有別於北側的西牛嶼退潮時會形成連結東莒島之潮間帶，林坳嶼終年與東莒島遙遙相望，無法直接與東莒島相連。 林坳嶼島上有各種奇形怪石、植物生態資源豐富，根據植物專家調查表示，島上之多年生濱柃木深具觀賞價值；另島上怪石林立，饒富神話故事傳奇，目前尚未開放登島，僅有部分釣友會前往林坳嶼進行垂釣，是東莒島的主要釣場之一，也是釣友兵家必爭之地。 馬祖地質公園縣定自然地景之一 由於林坳嶼的特殊地質以及豐富的植物生態，2018年時被劃定為縣定自然地景，是馬祖地質公園十大地區域之一。",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉林坳嶼",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2872&w=1280&h=960",
            "PictureDescription1": "林坳嶼"
          },
          "Position": {
            "PositionLat": 25.942569732666016,
            "PositionLon": 119.96761322021484,
            "GeoHash": "wst79ftwr"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020191",
          "Name": "西牛嶼",
          "DescriptionDetail": "潮退限定景點 馬祖版摩西分海 西牛嶼，或稱犀牛嶼，是東莒最著名的潮間帶，由沙灘、泥灘和礫石灘、礁岩等不同地質組成，因島形狀似犀牛而得名，在海水漲退之間，島嶼會與本島分離、接合，形成「陸連島」之景觀。 莒光在福建省閩江口外，剛好是淡水和海水交界，因此孕育出豐富的貝類及海鮮，當地盛產海瓜子（花蛤）、紫海膽、佛手、海鋼盔、紫菜、蠑螺及章魚等海鮮，種類極為豐富、口感鮮美，是公認的大自然冰箱，每逢農曆大潮期間，拾貝者絡繹其中，收穫豐碩。西牛嶼島上還有馬祖珍稀的海濱植物- 海芙蓉，可泡藥酒治療風濕等宿疾，島礁多為岩石構成，亦是東莒的絕佳釣場之一，不論是黑格、黑毛、鱸魚等季節性魚類，蘊藏豐富，也是釣客心中嚮往的所在之地呢！ 體驗摩西分海奇景 想親眼看到西牛嶼摩西分海的奇景，除了需算準漲、退潮時間（來回約需一小時），並穿上防滑鞋，並建議隨時留意潮汐變化，由熟悉當地的導遊帶領前往，以策安全。",
          "Description": "潮退限定景點 馬祖版摩西分海 西牛嶼，或稱犀牛嶼，是東莒最著名的潮間帶，由沙灘、泥灘和礫石灘、礁岩等不同地質組成，因島形狀似犀牛而得名，在海水漲退之間，島嶼會與本島分離、接合，形成「陸連島」之景觀。 莒光在福建省閩江口外，剛好是淡水和海水交界，因此孕育出豐富的貝類及海鮮，當地盛產海瓜子（花蛤）、紫海膽、佛手、海鋼盔、紫菜、蠑螺及章魚等海鮮，種類極為豐富、口感鮮美，是公認的大自然冰箱，每逢農曆大潮期間，拾貝者絡繹其中，收穫豐碩。西牛嶼島上還有馬祖珍稀的海濱植物- 海芙蓉，可泡藥酒治療風濕等宿疾，島礁多為岩石構成，亦是東莒的絕佳釣場之一，不論是黑格、黑毛、鱸魚等季節性魚類，蘊藏豐富，也是釣客心中嚮往的所在之地呢！ 體驗摩西分海奇景 想親眼看到西牛嶼摩西分海的奇景，除了需算準漲、退潮時間（來回約需一小時），並穿上防滑鞋，並建議隨時留意潮汐變化，由熟悉當地的導遊帶領前往，以策安全。",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉西牛嶼",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2881&w=1280&h=960",
            "PictureDescription1": "西牛嶼"
          },
          "Position": {
            "PositionLat": 25.969200134277344,
            "PositionLon": 119.97898864746094,
            "GeoHash": "wst7dpw19"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020192",
          "Name": "中流嶼",
          "DescriptionDetail": "東莒北海岸的小島嶼 中流嶼是福正聚落西北方一座從海中突起的小礁島，又稱為永留嶼，當地漁民亦稱之為漁澳，不生樹木，但貝類資源十分豐富；每逢潮退時分，礫灘裸露，正好將福正沙灘和鄰近的中流嶼連成一片，此時村民便會三五成群沿著礫石灘撿拾來自大自然的恩惠，撿拾貝類、海菜，享受豐收的樂趣，保證不虛此行。 備註：前往當地旅遊時，建議隨時留意潮汐變化，注意安全。",
          "Description": "東莒北海岸的小島嶼 中流嶼是福正聚落西北方一座從海中突起的小礁島，又稱為永留嶼，當地漁民亦稱之為漁澳，不生樹木，但貝類資源十分豐富；每逢潮退時分，礫灘裸露，正好將福正沙灘和鄰近的中流嶼連成一片，此時村民便會三五成群沿著礫石灘撿拾來自大自然的恩惠，撿拾貝類、海菜，享受豐收的樂趣，保證不虛此行。 備註：前往當地旅遊時，建議隨時留意潮汐變化，注意安全。",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉中流嶼",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2887&w=1280&h=960",
            "PictureDescription1": "中流嶼"
          },
          "Position": {
            "PositionLat": 25.970029830932617,
            "PositionLon": 119.97982788085938,
            "GeoHash": "wst7dpwwk"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        },
        {
          "ID": "C1_315081000H_020193",
          "Name": "青帆港",
          "DescriptionDetail": "昔日小香港 西莒的重要出入門戶 青帆港位在西莒島的南岸，是西莒出入的重要門戶，也是莒光鄉的行政中心，原名「青藩」，據說曾因有外國人居住於此而得名；倚著山坡而立的青帆村視野極佳，瞭望無際海面，白色山城配上萬里藍天，散發出地中海風情。 青帆村土地面積約134公頃，是商圈、聚落、港口，更是西莒島最熱鬧的村落，清末繁華時期，更是馬祖唯一設「鎮」之地，華洋輪船駛入閩江前必須在青帆澳口候潮補給，因而貿易盛行、熱鬧非凡，有「小香港」之稱；全盛時期曾轄有青東里、青西里，至今仍是莒光最熱鬧的市集，攤商、市場、餐飲和機關單位都集中在這裡。 走在村落屋舍之間，石牆、階梯上的標語，讓人彷彿回到了過往時空，村裡的古厝縮著身子委伏於新式建築之中，漁寮深鎖，昔日鼎盛的討海記憶褪了色；老屋門楣上的國徽為物換星移而長嘆。青帆境天后宮在老街上方，港口旁的威武陳元帥廟是本村及全島的信仰中心、香火極盛。 美國CIA「西方公司」旗幟飄揚山海一家 1920年代末，親日的偽「和平救國軍第二路軍」盤據於此；1930年代末，東海部隊轉進，司令部設在「山海一家」；1940年代初期，韓戰期間，美國CIA以「西方公司」名義進駐青帆山蒐集情報，於是美國國旗－星條旗曾在青帆村的山海一家飄揚了一段時日，故此，青帆港有著非常豐采的人文歷史，訴說著在地的故事。 威武陳元帥廟 青帆村的信仰中心 西莒威武陳元帥廟是當地的獨特信仰，陳元帥本名陳湯銘，為人好打抱不平，人稱陳大哥；成仁後肉身隨波漂至今青帆港，三天三夜不去，先民大奇，於是許願如出海滿載而歸就好好安葬他，不料竟然應驗，眾人愈發好奇，再次立誓如果捕獲無頭黃魚就立廟奉祀，隔天果然一樣靈驗，於是立廟尊祀至今。",
          "Description": "昔日小香港 西莒的重要出入門戶 青帆港位在西莒島的南岸，是西莒出入的重要門戶，也是莒光鄉的行政中心，原名「青藩」，據說曾因有外國人居住於此而得名；倚著山坡而立的青帆村視野極佳，瞭望無際海面，白色山城配上萬里藍天，散發出地中海風情。 青帆村土地面積約134公頃，是商圈、聚落、港口，更是西莒島最熱鬧的村落，清末繁華時期，更是馬祖唯一設「鎮」之地，華洋輪船駛入閩江前必須在青帆澳口候潮補給，因而貿易盛行、熱鬧非凡，有「小香港」之稱；全盛時期曾轄有青東里、青西里，至今仍是莒光最熱鬧的市集，攤商、市場、餐飲和機關單位都集中在這裡。 走在村落屋舍之間，石牆、階梯上的標語，讓人彷彿回到了過往時空，村裡的古厝縮著身子委伏於新式建築之中，漁寮深鎖，昔日鼎盛的討海記憶褪了色；老屋門楣上的國徽為物換星移而長嘆。青帆境天后宮在老街上方，港口旁的威武陳元帥廟是本村及全島的信仰中心、香火極盛。 美國CIA「西方公司」旗",
          "Phone": "886-836-89388",
          "Address": "連江縣莒光鄉青帆港",
          "ZipCode": "211",
          "OpenTime": "全天",
          "Picture": {
            "PictureUrl1": "https://www.matsu-nsa.gov.tw/FileArtPic.ashx?id=2890&w=1280&h=960",
            "PictureDescription1": "青帆港"
          },
          "Position": {
            "PositionLat": 25.96632957458496,
            "PositionLon": 119.93536376953125,
            "GeoHash": "wst79pn2b"
          },
          "Class1": "生態類",
          "Class2": "國家風景區類",
          "Class3": "自然風景類",
          "ParkingPosition": {},
          "TicketInfo": "免費",
          "SrcUpdateTime": "2021-04-03T01:12:20+08:00",
          "UpdateTime": "2021-04-03T01:33:07+08:00"
        }
      ]
class Scienc extends React.Component{
    constructor(props){
        super(props)
        this.state = {
          flag:30,
          points:[]
        }
    }
    componentDidMount(){
        window.addEventListener('scroll', this.isBottom)
        this.setState({
            points:test
        },() => {
            // console.log("start") 
            // console.log(this.state)
        })
        // fetch(`https://ptx.transportdata.tw/MOTC/v2/Tourism/ScenicSpot?$top=${flag}`)
        // fetch('../src/components/Keelung.json')
        // .then(res => res.json())
        // .then(data => {
        //   console.log("fetch")
        //     console.log(data)
        //     this.setState({
        //       points:data
        //     })
        // })
    }
    componentWillUnmount(){
        window.removeEventListener('scroll', this.isBottom)
    }
    
    render_component() { 
        let mapp = []
        
        if (this.state.points.length > 0) 
            mapp = this.state.points.map((data, index) =>{
                return(
                    <tr key={index} id={index}>
                        <td>{data.Name}</td>
                        <td>{data.Description}</td>
                    </tr> 
                )
            })
        return mapp
    }
    isBottom = () =>{
      const {flag,points} = this.state
        if(window.innerHeight + window.pageYOffset >= document.body.offsetHeight){
          fetch(`https://ptx.transportdata.tw/MOTC/v2/Tourism/ScenicSpot?$top=${flag+30}&$skip=${flag}`)
          .then(res => res.json())
          .then(data => {
            console.log("bottom fetch")
            console.log(data)
            let merged = points.concat(data)
              this.setState({
                flag:flag+30,
                points:merged
              },()=>{
                console.log("merged")
                console.log(this.state.points)
              })
          })
        }
            
    }
    render() {
        return(
            <div className="container" id="header">
                <Table striped bordered hover>
                    <thead>
                        <tr>
                            <th width="20%">名稱</th>
                            <th width="80%">簡介</th>
                        </tr>
                    </thead>
                    <tbody>
                        {this.render_component()}
                    </tbody>
                </Table>
                
            </div>
        )
    }
}

// function Sciencs (){
//     const [views, setViews] = useState({})

// //   useEffect(() =>{
// //     // fetch(`https://ptx.transportdata.tw/MOTC/v2/Tourism/ScenicSpot?$top=${flag}`)
// //     fetch(`./test.txt`)
// //     .then(res => res.json())
// //     .then(data => {
// //       console.log(data)
// //       setViews(data)
// //     })
// //   }, [])
//     // useEffect(() => {
//     //     const onScroll = () =>{
//     //         const element = document.getElementById('header')
//     //         console.log(element.target.scrollHeight , element.target.scrollTop , element.target.clientHeight)
//     //         const bottom = element.target.scrollHeight - element.target.scrollTop === element.target.clientHeight
//     //         console.log('reached')
//     //     }
//     //     window.addEventListener('scroll', onScroll)
//     //     return () => {
//     //         window.removeEventListener('scroll', onScroll)
//     //     }
//     // }, [])
//     // const isBottom = (el) =>  {
//     //     return el.getBoundingClientRect().bottom <= window.innerHeight;
//     //   }
//     // const scrollbottom = () =>{
//     //     const wrappedElement = document.getElementById('header');
//     //     if (isBottom(wrappedElement)) {
//     //         console.log('header bottom reached');
//     //         document.removeEventListener('scroll', scrollbottom);
//     //     }
//     // }
//     // const isBottom = e =>{
//     //     const bottom = e.target.scrollHeight - e.target.scrollTop === e.target.clientHeight;
//     //     console.log("reach")
//     // }
  
     
//   const render_component = 
//     test.map((data, index) =>{
//       return(
//         <tr key={index} id={index}>
//             <td>{data.Name}</td>
//             <td>{data.Description}</td>
//         </tr> 
//       )
//     })
  
//     return (
//         <Container id="header" >
//             <Table striped bordered hover>
//                 <thead>
//                     <tr>
//                         <th width="20%">名稱</th>
//                         <th width="80%">簡介</th>
//                     </tr>
//                 </thead>
//                 {render_component}
//             </Table>
            
//         </Container>
//     )
// }

export default Scienc;